-- phpMyAdmin SQL Dump
-- version 3.2.3
-- http://www.phpmyadmin.net
--
-- Host: localhost
-- Generation Time: Feb 19, 2013 at 10:56 AM
-- Server version: 5.1.40
-- PHP Version: 5.3.3

SET SQL_MODE="NO_AUTO_VALUE_ON_ZERO";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- Database: `shmaliym_cat`
--

-- --------------------------------------------------------

--
-- Table structure for table `cache`
--

DROP TABLE IF EXISTS `cache`;
CREATE TABLE IF NOT EXISTS `cache` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `alias` varchar(40) NOT NULL,
  `content` text NOT NULL,
  `created` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=cp1251 AUTO_INCREMENT=10 ;

--
-- Dumping data for table `cache`
--

INSERT INTO `cache` (`id`, `alias`, `content`, `created`) VALUES
(9, 'topMenu', 'a:7:{i:0;a:13:{s:2:"id";s:2:"58";s:9:"parent_id";s:1:"5";s:5:"title";s:14:"Главная";s:11:"title_alias";s:0:"";s:4:"link";s:3:"/ru";s:9:"published";s:1:"1";s:8:"ordering";s:1:"1";s:11:"checked_out";s:1:"0";s:16:"checked_out_time";s:19:"0000-00-00 00:00:00";s:11:"browser_nav";s:1:"0";s:5:"image";s:0:"";s:6:"childs";a:0:{}s:7:"current";i:1;}i:1;a:13:{s:2:"id";s:2:"51";s:9:"parent_id";s:1:"5";s:5:"title";s:19:"О компании";s:11:"title_alias";s:0:"";s:4:"link";s:14:"/ru/about.html";s:9:"published";s:1:"1";s:8:"ordering";s:1:"2";s:11:"checked_out";s:1:"0";s:16:"checked_out_time";s:19:"0000-00-00 00:00:00";s:11:"browser_nav";s:1:"0";s:5:"image";s:28:"/contents/mainmenu/about.png";s:6:"childs";a:0:{}s:7:"current";i:0;}i:2;a:13:{s:2:"id";s:2:"52";s:9:"parent_id";s:1:"5";s:5:"title";s:14:"Новости";s:11:"title_alias";s:0:"";s:4:"link";s:8:"/ru/news";s:9:"published";s:1:"1";s:8:"ordering";s:1:"3";s:11:"checked_out";s:1:"0";s:16:"checked_out_time";s:19:"0000-00-00 00:00:00";s:11:"browser_nav";s:1:"0";s:5:"image";s:27:"/contents/mainmenu/menu.png";s:6:"childs";a:0:{}s:7:"current";i:0;}i:3;a:13:{s:2:"id";s:2:"59";s:9:"parent_id";s:1:"5";s:5:"title";s:18:"Продукция";s:11:"title_alias";s:0:"";s:4:"link";s:14:"/ru/production";s:9:"published";s:1:"1";s:8:"ordering";s:1:"4";s:11:"checked_out";s:1:"0";s:16:"checked_out_time";s:19:"0000-00-00 00:00:00";s:11:"browser_nav";s:1:"0";s:5:"image";s:0:"";s:6:"childs";a:10:{i:0;a:13:{s:2:"id";s:2:"62";s:9:"parent_id";s:2:"59";s:5:"title";s:41:"Покрытые электроды  SMAW";s:11:"title_alias";s:0:"";s:4:"link";s:19:"/ru/production/smaw";s:9:"published";s:1:"1";s:8:"ordering";s:1:"1";s:11:"checked_out";s:1:"0";s:16:"checked_out_time";s:19:"0000-00-00 00:00:00";s:11:"browser_nav";s:1:"0";s:5:"image";s:0:"";s:6:"childs";a:0:{}s:7:"current";i:0;}i:1;a:13:{s:2:"id";s:2:"63";s:9:"parent_id";s:2:"59";s:5:"title";s:61:"Сплошная проволока и прутки GMAW/GTAW";s:11:"title_alias";s:0:"";s:4:"link";s:24:"/ru/production/gmaw_gtaw";s:9:"published";s:1:"1";s:8:"ordering";s:1:"2";s:11:"checked_out";s:1:"0";s:16:"checked_out_time";s:19:"0000-00-00 00:00:00";s:11:"browser_nav";s:1:"0";s:5:"image";s:0:"";s:6:"childs";a:0:{}s:7:"current";i:0;}i:2;a:13:{s:2:"id";s:2:"64";s:9:"parent_id";s:2:"59";s:5:"title";s:44:"Порошковая проволока FCAW";s:11:"title_alias";s:0:"";s:4:"link";s:19:"/ru/production/fcaw";s:9:"published";s:1:"1";s:8:"ordering";s:1:"3";s:11:"checked_out";s:1:"0";s:16:"checked_out_time";s:19:"0000-00-00 00:00:00";s:11:"browser_nav";s:1:"0";s:5:"image";s:0:"";s:6:"childs";a:0:{}s:7:"current";i:0;}i:3;a:13:{s:2:"id";s:2:"65";s:9:"parent_id";s:2:"59";s:5:"title";s:70:"Самозащитная порошковая проволока OAFCM";s:11:"title_alias";s:0:"";s:4:"link";s:20:"/ru/production/oafcm";s:9:"published";s:1:"1";s:8:"ordering";s:1:"4";s:11:"checked_out";s:1:"0";s:16:"checked_out_time";s:19:"0000-00-00 00:00:00";s:11:"browser_nav";s:1:"0";s:5:"image";s:0:"";s:6:"childs";a:0:{}s:7:"current";i:0;}i:4;a:13:{s:2:"id";s:2:"66";s:9:"parent_id";s:2:"59";s:5:"title";s:76:"Проволоки и ленты для сварки под флюсом SAW";s:11:"title_alias";s:0:"";s:4:"link";s:18:"/ru/production/saw";s:9:"published";s:1:"1";s:8:"ordering";s:1:"5";s:11:"checked_out";s:1:"0";s:16:"checked_out_time";s:19:"0000-00-00 00:00:00";s:11:"browser_nav";s:1:"0";s:5:"image";s:0:"";s:6:"childs";a:0:{}s:7:"current";i:0;}i:5;a:13:{s:2:"id";s:2:"67";s:9:"parent_id";s:2:"59";s:5:"title";s:33:"Трубный сортамент";s:11:"title_alias";s:0:"";s:4:"link";s:25:"/ru/production/tube_gauge";s:9:"published";s:1:"1";s:8:"ordering";s:1:"6";s:11:"checked_out";s:1:"0";s:16:"checked_out_time";s:19:"0000-00-00 00:00:00";s:11:"browser_nav";s:1:"0";s:5:"image";s:0:"";s:6:"childs";a:0:{}s:7:"current";i:0;}i:6;a:13:{s:2:"id";s:2:"68";s:9:"parent_id";s:2:"59";s:5:"title";s:36:"Материалы для пайки";s:11:"title_alias";s:0:"";s:4:"link";s:38:"/ru/production/materials_for_soldering";s:9:"published";s:1:"1";s:8:"ordering";s:1:"7";s:11:"checked_out";s:1:"0";s:16:"checked_out_time";s:19:"0000-00-00 00:00:00";s:11:"browser_nav";s:1:"0";s:5:"image";s:0:"";s:6:"childs";a:0:{}s:7:"current";i:0;}i:7;a:13:{s:2:"id";s:2:"69";s:9:"parent_id";s:2:"59";s:5:"title";s:43:"Вольфрамовые электроды";s:11:"title_alias";s:0:"";s:4:"link";s:34:"/ru/production/tungsten_electrodes";s:9:"published";s:1:"1";s:8:"ordering";s:1:"8";s:11:"checked_out";s:1:"0";s:16:"checked_out_time";s:19:"0000-00-00 00:00:00";s:11:"browser_nav";s:1:"0";s:5:"image";s:0:"";s:6:"childs";a:0:{}s:7:"current";i:0;}i:8;a:13:{s:2:"id";s:2:"70";s:9:"parent_id";s:2:"59";s:5:"title";s:43:"Керамические прокладки";s:11:"title_alias";s:0:"";s:4:"link";s:27:"/ru/production/ceramic pads";s:9:"published";s:1:"1";s:8:"ordering";s:1:"9";s:11:"checked_out";s:1:"0";s:16:"checked_out_time";s:19:"0000-00-00 00:00:00";s:11:"browser_nav";s:1:"0";s:5:"image";s:0:"";s:6:"childs";a:0:{}s:7:"current";i:0;}i:9;a:13:{s:2:"id";s:2:"71";s:9:"parent_id";s:2:"59";s:5:"title";s:39:"Химические материалы";s:11:"title_alias";s:0:"";s:4:"link";s:24:"/ru/production/chemicals";s:9:"published";s:1:"1";s:8:"ordering";s:2:"10";s:11:"checked_out";s:1:"0";s:16:"checked_out_time";s:19:"0000-00-00 00:00:00";s:11:"browser_nav";s:1:"0";s:5:"image";s:0:"";s:6:"childs";a:0:{}s:7:"current";i:0;}}s:7:"current";i:0;}i:4;a:13:{s:2:"id";s:2:"60";s:9:"parent_id";s:1:"5";s:5:"title";s:35:"Области применения";s:11:"title_alias";s:0:"";s:4:"link";s:16:"/ru/areas_of_use";s:9:"published";s:1:"1";s:8:"ordering";s:1:"5";s:11:"checked_out";s:1:"0";s:16:"checked_out_time";s:19:"0000-00-00 00:00:00";s:11:"browser_nav";s:1:"0";s:5:"image";s:0:"";s:6:"childs";a:0:{}s:7:"current";i:0;}i:5;a:13:{s:2:"id";s:2:"61";s:9:"parent_id";s:1:"5";s:5:"title";s:14:"Справка";s:11:"title_alias";s:0:"";s:4:"link";s:13:"/ru/reference";s:9:"published";s:1:"1";s:8:"ordering";s:1:"6";s:11:"checked_out";s:1:"0";s:16:"checked_out_time";s:19:"0000-00-00 00:00:00";s:11:"browser_nav";s:1:"0";s:5:"image";s:0:"";s:6:"childs";a:0:{}s:7:"current";i:0;}i:6;a:13:{s:2:"id";s:2:"55";s:9:"parent_id";s:1:"5";s:5:"title";s:16:"Контакты";s:11:"title_alias";s:0:"";s:4:"link";s:17:"/ru/contacts.html";s:9:"published";s:1:"1";s:8:"ordering";s:1:"7";s:11:"checked_out";s:1:"0";s:16:"checked_out_time";s:19:"0000-00-00 00:00:00";s:11:"browser_nav";s:1:"0";s:5:"image";s:31:"/contents/mainmenu/contacts.png";s:6:"childs";a:0:{}s:7:"current";i:0;}}', 1343669756);

-- --------------------------------------------------------

--
-- Table structure for table `cmscategories`
--

DROP TABLE IF EXISTS `cmscategories`;
CREATE TABLE IF NOT EXISTS `cmscategories` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `parent_id` int(11) NOT NULL,
  `title` text NOT NULL,
  `title_alias` text NOT NULL,
  `description` text NOT NULL,
  `published` int(11) NOT NULL,
  `checked_out` int(11) NOT NULL,
  `checked_out_time` datetime NOT NULL,
  `ordering` int(11) NOT NULL,
  `image` text NOT NULL,
  `images` text NOT NULL,
  `param1` text NOT NULL,
  `param2` text NOT NULL,
  `param3` text CHARACTER SET utf8 NOT NULL,
  `param4` text NOT NULL,
  `param5` text NOT NULL,
  `param6` text NOT NULL,
  `param7` text NOT NULL,
  `param8` text NOT NULL,
  `param9` text NOT NULL,
  `param10` text NOT NULL,
  `param11` text NOT NULL,
  `param12` text NOT NULL,
  `param13` text NOT NULL,
  `param14` text NOT NULL,
  `param15` text NOT NULL,
  `param16` text NOT NULL,
  `param17` text NOT NULL,
  `param18` text NOT NULL,
  `param19` text NOT NULL,
  `param20` text NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=cp1251 AUTO_INCREMENT=15 ;

--
-- Dumping data for table `cmscategories`
--

INSERT INTO `cmscategories` (`id`, `parent_id`, `title`, `title_alias`, `description`, `published`, `checked_out`, `checked_out_time`, `ordering`, `image`, `images`, `param1`, `param2`, `param3`, `param4`, `param5`, `param6`, `param7`, `param8`, `param9`, `param10`, `param11`, `param12`, `param13`, `param14`, `param15`, `param16`, `param17`, `param18`, `param19`, `param20`) VALUES
(1, 0, 'О нас', 'about', '', 1, 0, '0000-00-00 00:00:00', 4, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(2, 0, 'Новости', 'news', '', 1, 0, '0000-00-00 00:00:00', 3, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(3, 0, 'Услуги', 'services', '', 1, 0, '0000-00-00 00:00:00', 2, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(4, 0, 'Товары', 'goods', '', 1, 0, '0000-00-00 00:00:00', 1, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(5, 1, 'Сотрудники', 'employees', '', 1, 0, '0000-00-00 00:00:00', 1, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(6, 2, 'Конпания', 'company', '', 1, 0, '0000-00-00 00:00:00', 3, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(7, 2, 'Партнеры', 'partners', '', 1, 0, '0000-00-00 00:00:00', 2, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(8, 2, 'Отрасль', 'industry', '', 1, 0, '0000-00-00 00:00:00', 1, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(9, 3, 'Пакетные услуги', 'batch', '', 1, 0, '0000-00-00 00:00:00', 1, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(10, 3, 'Голосовые услуги', 'vioce', '', 1, 0, '0000-00-00 00:00:00', 2, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(11, 3, 'Обмен сообщениями', 'messages', '', 1, 0, '0000-00-00 00:00:00', 3, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(12, 4, 'Ноутбуки', 'notebooks', '', 1, 0, '0000-00-00 00:00:00', 3, '/contents/goods-cats/notebooks.png', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(13, 4, 'Компьютеры', 'desctops', '', 1, 0, '0000-00-00 00:00:00', 2, '/contents/goods-cats/generic-office-desktop.png', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(14, 4, 'Мобильные телефоны', 'cellphones', '', 1, 0, '0000-00-00 00:00:00', 1, '/contents/goods-cats/cellphone.png', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '');

-- --------------------------------------------------------

--
-- Table structure for table `cmscontent`
--

DROP TABLE IF EXISTS `cmscontent`;
CREATE TABLE IF NOT EXISTS `cmscontent` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `parent_id` text CHARACTER SET cp1251 NOT NULL,
  `title` text CHARACTER SET cp1251 NOT NULL,
  `title_alias` text CHARACTER SET cp1251 NOT NULL,
  `introtext` text CHARACTER SET cp1251 NOT NULL,
  `fulltext` text CHARACTER SET cp1251 NOT NULL,
  `created` bigint(20) NOT NULL,
  `created_by` int(11) NOT NULL,
  `published` int(11) NOT NULL,
  `publish_up` bigint(20) NOT NULL,
  `publish_down` bigint(20) NOT NULL,
  `checked_out` int(11) NOT NULL,
  `checked_out_time` datetime NOT NULL,
  `ordering` int(11) NOT NULL,
  `image` text CHARACTER SET cp1251 NOT NULL,
  `images` text CHARACTER SET cp1251 NOT NULL,
  `hits` int(11) NOT NULL,
  `param1` text CHARACTER SET cp1251 NOT NULL,
  `param2` text CHARACTER SET cp1251 NOT NULL,
  `param3` text CHARACTER SET cp1251 NOT NULL,
  `param4` text NOT NULL,
  `param5` text NOT NULL,
  `param6` text NOT NULL,
  `param7` text CHARACTER SET cp1251 NOT NULL,
  `param8` text CHARACTER SET cp1251 NOT NULL,
  `param9` text CHARACTER SET cp1251 NOT NULL,
  `param10` text CHARACTER SET cp1251 NOT NULL,
  `param11` text CHARACTER SET cp1251 NOT NULL,
  `param12` text CHARACTER SET cp1251 NOT NULL,
  `param13` text CHARACTER SET cp1251 NOT NULL,
  `param14` text CHARACTER SET cp1251 NOT NULL,
  `param15` text CHARACTER SET cp1251 NOT NULL,
  `param16` text CHARACTER SET cp1251 NOT NULL,
  `param17` text CHARACTER SET cp1251 NOT NULL,
  `param18` text CHARACTER SET cp1251 NOT NULL,
  `param19` text CHARACTER SET cp1251 NOT NULL,
  `param20` text CHARACTER SET cp1251 NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=45 ;

--
-- Dumping data for table `cmscontent`
--

INSERT INTO `cmscontent` (`id`, `parent_id`, `title`, `title_alias`, `introtext`, `fulltext`, `created`, `created_by`, `published`, `publish_up`, `publish_down`, `checked_out`, `checked_out_time`, `ordering`, `image`, `images`, `hits`, `param1`, `param2`, `param3`, `param4`, `param5`, `param6`, `param7`, `param8`, `param9`, `param10`, `param11`, `param12`, `param13`, `param14`, `param15`, `param16`, `param17`, `param18`, `param19`, `param20`) VALUES
(2, '0', 'Презентация', 'presentation', 'Понадобилось как-то нашим казначеям сменить ключ-пароль в банк-клиенте  сине-зелёного банка. Таких плясок с бубнами трёх отделов (программистов,  отдела безопасности, начальника программистов Приморского филиала) не  было уже давно.', 'Сначала наш отдел безопасности учил компьютер с  клиентом обходить  прокси-сервер. Перенастраивали IE, так как политика  нашего домена очень  отличается от настроек удостоверяющего центра банка  по  параноидальности. Затем переставляли &laquo;Крипто-про&raquo;, которая не желала   поднимать шифрованный канал для связи с удостоверяющим центром банка.   Так как права у пользователей порезаны безопасниками в приступе паранойи   по самые гланды, действо происходило под очень забавный речитатив с   упоминанием родственников по женской линии.', 1360703130, 0, 1, 1360703130, 943912800, 0, '0000-00-00 00:00:00', 3, '', '', 0, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(3, '0', 'SEO', 'seo', 'Вы можете воспользоваться откатом файлов из панели управления backup и  восстановить состояние сайта или базы на момент, когда проблема не  наблюдалась. К сожалению, автоматическая система резервного копирования  сохраняет бэкапы только за последние три дня (резервные копии создаются в  ночное время). Если вам необходимо хранить их дольше, вы можете  сохранить резервные копии в своём корневом каталоге, в разделе  &laquo;Управление BACKUP&raquo; выбрав функцию &laquo;Сохранить бэкап&raquo;. Или делать их  самостоятельно с помощью скриптов и панели crontab.', '', 1360704642, 0, 1, 1360704642, 943912800, 0, '0000-00-00 00:00:00', 2, '', '', 0, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(4, '0', 'Контакты', 'contacts', '&mdash; Здравствуйте, чегой-то у нас интернет пропал.<br /><br />&mdash; Здравствуйте, по какому адресу установлено подключение? &mdash; отвечает женский голос.<br /><br />Диктую адрес.<br /><br />&mdash; Сообщите, пожалуйста, IP-адрес.<br /><br />&mdash; Дык, он у нас вроде того&hellip; динамический.<br /><br />&mdash; Что значит динамический? Какой IP у компьютера вашего?<br /><br />&mdash; Да какая разница? У нас двадцать компьютеров, и ни на одном интернета нет.<br /><br />&mdash; <em>(Сквозь зубы.)</em> Сообщите, пожалуйста, IP-адрес компьютера.<br /><br />&mdash; Ну, допустим, 192.168.1.100.<br /><br />&mdash; Подождите, пожалуйста&hellip; <em>(Секунд тридцать стучит по клавишам.)</em> Так, всё ясно. Перезагрузите модем!<br /><br />Теперь вот думаю, что она там делала эти тридцать секунд &mdash; неужто пинговала?', '', 1360707186, 0, 1, 1360707186, 943912800, 0, '0000-00-00 00:00:00', 1, '', '', 0, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(5, '1', 'О нас', 'about', 'Готовим к запуску АСУ. На объекте пропускной режим &mdash; не суровый, но на  всякий случай записываем оборудование, которое заносим, чтобы не  возникало лишних вопросов при выходе. Записывает охранник под диктовку,  потом ставим подпись. Дело нехитрое.<br /><br />В очередной раз прохожу эту  нехитрую процедуру. Взгляд падает на список, который был подписан мной в  прошлый раз. Там обнаруживаю два загадочных объекта.<br /><br />1.  Вольтиметр. Видимо, охранник ничего не слышал о таких приборах, как  мультиметры, зато вольтметр где-то в задворках разума со школьных  экспериментов остался. Вот и скрестил услышанное со знакомым.<br /><br />2.  Электронслятор. Вот так вот банальный ретранслятор, он же повторитель  сигнала для RS-485, превратился в неизвестного зверя. Видимо, в голове  опять немыслимым образом замкнулись цепочки, и преобразователь сигнала  из устной формы в письменную дал сбой.<br /><br />Хорошо, что на выходе всё-таки редко спрашивают, что выносим, а то пришлось бы показывать <em>это</em>.', '', 1360707941, 0, 1, 1360707941, 943912800, 0, '0000-00-00 00:00:00', 3, '', '', 0, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(6, '1', 'История', 'history', '&mdash; Слушай, Петров. Банкет окончен, все разошлись по домам. А ты  останься-ка ещё ненадолго. Ты же сисадмин, ты же самый умный. Расскажи,  что за гаджет вы мне подарили всем коллективом на день рождения? Это  плеер? Карманный раздвижной телескоп? Фонарь? Электронная сигарета? Что  это и как этим пользоваться?<br /><br />&mdash; Всё очень просто, шеф. Это перьевая ручка.<br /><br />&mdash; В смысле, рукоятка? А от чего?<br /><br />&mdash; Это не рукоятка. Это прибор для непосредственного нанесения изображений и текстов на бумагу.<br /><br />&mdash; Как &mdash; непосредственного?<br /><br />&mdash; Ну, минуя компьютер и принтер. С пальцев &mdash; сразу на бумагу.<br /><br />&mdash; У неё внутри миниатюрный компьютер с принтером? Гениально!<br /><br />&mdash;  В том-то и дело, что нет. Ну, это долго объяснять. Проще показать. Вот,  снимаем колпачок. Как с флешки. Теперь заправляем чернилами, ну, как  заправляемый картридж для струйника.<br /><br />&mdash; Ой, что это за фигурная  заострённая металлическая пластина под колпачком? Экранирующая накладка  разъёма? Но какого стандарта? Ни на один из мне известных не похож. И  где под этой накладкой контакты?<br /><br />&mdash; Будем считать, что это печатающая головка.<br /><br />&mdash; А дальше что делать?<br /><br />&mdash; Вот, глядите: ведём заострённой частью этой пластины по бумаге по траектории, соответствующей форме символа. Видите?<br /><br />&mdash; А что, ладно выходит. Необычно. Как бы это сказать, необычно гармонично. Дай-ка, Петров, теперь я попробую.<br /><br />&mdash; Пробуйте, шеф. Да не так надо гаджет держать, а вот так.<br /><br />&mdash; А какая разница?<br /><br />&mdash;  Так перемещения пальцев лучше передаются гаджету. Исключается  дополнительная погрешность. Это же аналоговый прибор, в нём нет  дискретизации. А шум есть, и нужно принимать меры для его уменьшения.<br /><br />&mdash; Аналоговый? Как мой проигрыватель для винила?<br /><br />&mdash; Ну да.<br /><br />&mdash;  Это хорошо. Аналоговый &mdash; значит, престижный! Только у меня не  получается нанести ни символа. На компьютере ведь как всё просто: нажал  клавишу &mdash; символ сам появился. А тут надо вручную перемещать печатающую  головку по траектории, соответствующей форме символа.<br /><br />&mdash; Ничего, шеф, научитесь ещё. На Ютюбе есть уроки использования этого гаджета.<br /><br />&mdash; Скажи, Петров, а эта вещь, должно быть, новейшее изобретение?<br /><br />&mdash; Скорее, хорошо забытое старое.<br /><br />&mdash;  Ну да ладно. Главное, мой коллектив обеспечил меня таким интересным  гаджетом, которого у меня никогда ещё не было. Буду осваивать  потихонечку. А ты, Петров, можешь считать теперь, что премия у тебя в  кармане!', '', 1360708006, 0, 1, 1360708006, 943912800, 0, '0000-00-00 00:00:00', 2, '', '', 0, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(7, '1', 'Преимущества', 'benefits', 'Мой однокурсник (учимся на связистов в военном училище) познакомился в  интернете с девушкой с филфака и договорился о встрече. Естественно, по  соцсетям трудно определить, каков на самом деле человек. Товарищ  попросил меня о помощи: если девушка не понравится или окажется  глуповатой, эвакуировать его со свидания. Был разработан план по всей  курсантской науке: после встречи я жду полчаса, связываюсь с  однокурсником; если тот даёт намёк на контроль ситуации, я его покидаю,  если нет &mdash; под важным предлогом забираю.<br /><br />День свидания. Заняв  позицию, наблюдаю, как однокурсник встречает девушку и ведёт её гулять.  Жду полчаса, останавливаю проезжающее мимо такси. В машине достаю  распечатку курсача по программированию, прошу водителя остановить прямо  перед прогуливающейся парочкой и чуть подождать. Выйдя из машины,  подбегаю к товарищу, протягиваю ему листинг (так, чтобы и девушка могла  рассмотреть код) и взволнованно говорю:<br /><br />&mdash; Евгений, срочно нужна  твоя помощь! У начальства полетел генератор гаммирования! Похоже,  необходимо через HEX-редактор менять байтовую структуру библиотек!<br /><br />Делаю вид, что только заметил стоящую рядом девушку.<br /><br />&mdash; Чёрт&hellip; Ты сможешь со мной проехать в кабинет и на месте заменить протоколы?<br /><br />Однокурсник  внимательно смотрит распечатки, оборачивается на девушку, что-то  обмозговывает, и, возвращая листы, с умным видом выдаёт:<br /><br />&mdash; Тут  замены протоколов не нужно. Просто инвертируйте через редактор параметры  подключения копий библиотек &mdash; гаммирование снова заработает <em>(видно, что человека начинает заносить)</em> по ряду теоремы Котельникова.<br /><br />Девушка с немым восхищением смотрит на товарища. Тот берёт её под руку, отходит на пару шагов и, оборачиваясь, выдаёт:<br /><br />&mdash; И отмените сигнал три точки, три тире, три точки. Спасибо.<br /><br />Я,  сохраняя каменное выражение лица, говорю: &laquo;Сделаем!&raquo;, сажусь в машину,  сворачиваю за угол, даю деньги, выхожу, сажусь на скамейку и начинаю  рыдать со смеху.<br /><br />Наверно, с него бутылка.', '', 1360708049, 0, 1, 1360708049, 943912800, 0, '0000-00-00 00:00:00', 1, '', '', 0, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(8, '2', 'Ты мой файл папка класть', '', 'Спор между сторонниками командной строки и текстового интерфейса будет длиться вечно. Подолью-ка ещё масла в огонь.', 'Спор между сторонниками командной строки и текстового интерфейса будет длиться вечно. Подолью-ка ещё масла в огонь.<br /><br />Когда-то  то, что мы сегодня называем командной строкой, звалось совсем  по-другому &mdash; диалоговым режимом. Такое &laquo;общение&raquo; с машиной действительно  напоминает разговор человека с человеком: сначала один говорит, другой  слушает, потом наоборот. Мы, люди, к такому способу обмена информацией  привыкли с детства, и он кажется нам естественным.<br /><br />Ну, а  графический интерфейс напоминает общение с глухонемым, да не простым, а  не знающим языка жестов. Интересно, бывают ли такие глухонемые? И чтобы  ему что-то сказать, надо долго выискивать в специальном альбоме  картинку, а потом ему показывать, после чего он делает то же самое.  Интересно, естественен ли такой способ общения для человека?', 1360708656, 0, 1, 1360708656, 943912800, 0, '0000-00-00 00:00:00', 5, '/contents/news/urlhj.jpg', '', 0, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(9, '2', 'У вас спина белая и стекло битое', '', '<a href="http://ithappens.ru/story/10550">Первое апреля</a>? А я несколько лет назад стал невольным свидетелем более интересной первоапрельской шутки.', '<a href="http://ithappens.ru/story/10550">Первое апреля</a>? А я несколько лет назад стал невольным свидетелем более интересной первоапрельской шутки.<br /><br />Одно  время в &laquo;Макдональдсе&raquo; в состав &laquo;Хэппи-мила&raquo; входила игрушка, издающая  звук бьющегося стекла, но тихий. А вот если к ней подключить динамик  меньшего сопротивления и большего диаметра, звук становился гораздо  громче, отчётливее и правдоподобнее.<br /><br />Так один шутник и сделал.  Зашёл в электричку, сделал вид, что с силой ударил по стеклу кулаком, и  одновременно врубил свой имитатор звука бьющегося стекла. Окружающие  (стражей порядка, контролёров и охранников среди них не было) с  удивлением рассматривали абсолютно целое стекло. А потом хохмач  поздравил пассажиров с Днём смеха и показал свою &laquo;звенелку&raquo;. Настроение у  всех сразу поднялось.', 1360708748, 0, 1, 1360708748, 943912800, 0, '0000-00-00 00:00:00', 4, '/contents/news/url.jpg', '', 0, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(10, '2', 'Fus Ro Click', '', 'Я старый юзер, я не знаю слов ненависти. Я сама решаю все свои банальные  юзерские проблемы. Поставить, снести, настроить &mdash; говно, пардон,  вопрос. Но тут тако-ое&hellip;', 'Я старый юзер, я не знаю слов ненависти. Я сама решаю все свои банальные  юзерские проблемы. Поставить, снести, настроить &mdash; говно, пардон,  вопрос. Но тут тако-ое&hellip;<br /><br />Удалось наконец-то выкроить время,  метнуться до магазина барсиком и добыть вожделенную игру. Да, вышедшую  год назад. Но какую! &laquo;Беседка&raquo; не могла разочаровать, нет. Установка,  установка дополнительного парового двигателя, недолгий бой с паровым  двигателем, загрузка обновлений, запуск игры&hellip;<br /><br />Красота &mdash; смотреть  больно. Неописуемая. Горы, снег, ёлки, волки, драконы. Все идеально, вот  ровно как и должно быть. Но простите, где же моя прекрасная музыка?  Тихие голоса неписей доносятся откуда-то, но едва различимо. Настройки  громкости, смена наушников, ещё раз настройки, переключение на колонки&hellip;  Да в чём подвох-то? Звук доносится совсем не оттуда, но где-то он есть!  Только тихий очень.<br /><br />Старого юзера подвела мышка. Да-да, звук шёл  именно из неё. Из её спинки. Дослушав важный монолог непися с  приложенной к уху мышкой, старый юзер засейвилась, ухмыльнулась и  разобралась-таки в загадочных настройках. Но кому и зачем понадобилось  изобретать столь странный девайс и каким образом его экстраординарные  свойства оказались в приоритете у &laquo;Беседки&raquo;, до сих пор остаётся  загадкой.', 1360708882, 0, 1, 1360708882, 943912800, 0, '0000-00-00 00:00:00', 3, '/contents/news/sudoku-random-criss-crossed-lines-ron-brown.jpg', '', 0, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(11, '2', 'Недовес в два октета', '', 'Полторы недели просидел с ноутбуком в лифтовой на крыше дома. Запускали  пилотный проект видеонаблюдения &laquo;Безопасный город&raquo;. Косяков было много, и  к концу дня голова была просто забита сетевыми настройками.', 'Полторы недели просидел с ноутбуком в лифтовой на крыше дома. Запускали  пилотный проект видеонаблюдения &laquo;Безопасный город&raquo;. Косяков было много, и  к концу дня голова была просто забита сетевыми настройками.<br /><br />Зашёл  после работы в маркет шаговой доступности прикупить на ужин продуктов.  На дисплее кассы значилась сумма &mdash; 192.44. Я секунд двадцать ждал, когда  кассирша допишет IP, и думал, какой странный выбор подсети. Очнувшись,  понял, что надо докупить пива &mdash; отдохнуть.', 1360708934, 0, 1, 1360708934, 943912800, 0, '0000-00-00 00:00:00', 2, '/contents/news/ca9286181882.jpg', '', 0, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(12, '2', 'Маленькая малиновая умница', '', 'Сейчас модно мастерить всякие гаджеты на основе микрокомпьютера  Raspberry Pi. Поддался этой моде и я. Выписал из столицы диковинку,  оснастил линуксом, установил музыкальный проигрыватель, чтобы через  нормальные колонки, а не компьютерные &laquo;пищалки&raquo; свою обширную  музыкальную коллекцию слушать.', 'Сейчас модно мастерить всякие гаджеты на основе микрокомпьютера  Raspberry Pi. Поддался этой моде и я. Выписал из столицы диковинку,  оснастил линуксом, установил музыкальный проигрыватель, чтобы через  нормальные колонки, а не компьютерные &laquo;пищалки&raquo; свою обширную  музыкальную коллекцию слушать.<br /><br />Колонки и Raspberry Pi в комнате, а  управлять микрокомпьютером пришлось из кухни по SSH. Заработала система  не сразу, но довольно быстро всё срослось, в отладочном режиме музыка  заиграла. Настал момент прописывать необходимые команды в автозагрузку.  Прописал, ребутнулся, жду, когда SSH-сеанс восстановится. Нужно же  проверить, запустился ли MPD, какие ошибки произошли при монтировании  внешнего жёсткого диска и загрузке плейлиста. Решил, пока  перезагружается, новости почитать. А сосед по лестничной клетке тут же,  как назло, громко музыку врубил. Ой&hellip; Так ведь это у меня.<br /><br />Вот так вот, с первого раза, без мучений? Не люблю я, когда так бывает. Тем не менее, спасибо, маленькая умница.', 1360708968, 0, 1, 1360708968, 943912800, 0, '0000-00-00 00:00:00', 1, '/contents/news/7504125-an-illustration-of-a-random-pile-of-decorated-easter-eggs-the-image-will-tile-seamlessly.jpg', '', 0, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(25, '5', 'Иванов Иван', '', '<strong>Менеджер по продажам</strong><br /><br />тел.: 0636668899', '', 1360874571, 0, 1, 1360874571, 943912800, 0, '0000-00-00 00:00:00', 6, '/contents/eployees/client.png', '', 0, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(26, '5', 'Петр Петров', '', '<strong>Руководитель службы доставки</strong><br /><br />тел.: 0978569999', '', 1360874677, 0, 1, 1360874677, 943912800, 0, '0000-00-00 00:00:00', 5, '/contents/eployees/employer_hand.jpg', '', 0, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(27, '5', 'Сергеев Василий', '', '<strong>Главный бухгалтер</strong><br /><br />тел.: 0506985555', '', 1360874828, 0, 1, 1360874828, 943912800, 0, '0000-00-00 00:00:00', 4, '/contents/eployees/employer-man-handshake.jpg', '', 0, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(28, '5', 'Фахрутдинов Ринат', '', '<strong>Директор</strong><br /><br />тел.: 0669999999', '', 1360875045, 0, 1, 1360875045, 943912800, 0, '0000-00-00 00:00:00', 3, '/contents/eployees/xoyoxxx25.gif', '', 0, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(29, '5', 'Фадеева Светлана', '', '<strong>Бухгалтер</strong><br /><br />тел.: 0975689977', '', 1360875130, 0, 1, 1360875130, 943912800, 0, '0000-00-00 00:00:00', 2, '/contents/eployees/url.gif', '', 0, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(30, '5', 'Кармазина Татьяна', '', '<strong>Маркетолог</strong><br /><br />тел.: 0916050000', '', 1360875187, 0, 1, 1360875187, 943912800, 0, '0000-00-00 00:00:00', 1, '/contents/eployees/InternshipProgram_000.jpg', '', 0, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(34, '9', 'Пакет "СтарСвит Оптимальный"', '', 'Любовь и&nbsp;забота о&nbsp;родных не&nbsp;зависят от&nbsp;времени и&nbsp;расстояния. Где&nbsp;бы  ни&nbsp;были Ваши близкие, у&nbsp;Вас есть возможность связаться с&nbsp;ними в&nbsp;любой  момент. Ведь с&nbsp;пакетом &laquo;СтарСвитОптимальный&raquo; Вы&nbsp;можете звонить  за&nbsp;границу по&nbsp;выгодным тарифам. Общайтесь больше со&nbsp;своими близкими  и&nbsp;родными!', 'Любовь и&nbsp;забота о&nbsp;родных не&nbsp;зависят от&nbsp;времени и&nbsp;расстояния. Где&nbsp;бы  ни&nbsp;были Ваши близкие, у&nbsp;Вас есть возможность связаться с&nbsp;ними в&nbsp;любой  момент. Ведь с&nbsp;пакетом &laquo;СтарСвитОптимальный&raquo; Вы&nbsp;можете звонить  за&nbsp;границу по&nbsp;выгодным тарифам. Общайтесь больше со&nbsp;своими близкими  и&nbsp;родными!', 1360877361, 0, 1, 1360877361, 943912800, 0, '0000-00-00 00:00:00', 3, '/contents/services/url.png', '', 0, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(35, '9', 'SMS-пакеты', '', 'Начиная с&nbsp;1&nbsp;декабря 2011&nbsp;года абоненты предоплаченной связи имеют  возможность заказать новую услугу &laquo;Пакет SMS&raquo;. Каждый пользователь  сможет выбрать самое выгодное для него предложение и&nbsp;заказать &laquo;Пакет  30&nbsp;SMS&raquo; или &laquo;Пакет 60&nbsp;SMS&raquo;.', 'Начиная с&nbsp;1&nbsp;декабря 2011&nbsp;года абоненты предоплаченной связи имеют  возможность заказать новую услугу &laquo;Пакет SMS&raquo;. Каждый пользователь  сможет выбрать самое выгодное для него предложение и&nbsp;заказать &laquo;Пакет  30&nbsp;SMS&raquo; или &laquo;Пакет 60&nbsp;SMS&raquo;.<br /><br /> \n<table style="width: 100%;" border="0">\n<tbody>\n<tr>\n<td>\n<p>Мой Киевстар/ Мой DJUICE</p>\n</td>\n<td>\n<p>+</p>\n</td>\n<td>\n<p>+</p>\n</td>\n</tr>\n</tbody>\n</table>\n<ul>\n<li>Пакетные SMS действуют на протяжении 7 дней с момента их начисления.  Не использованные на протяжении 7 дней пакетные SMS аннулируются и  начисляется новый объем пакетных SMS. Плановое начисление пакетных SMS  происходит автоматически через каждые 7 дней.</li>\n<li>Вы&nbsp;имеете возможность заказывать пакеты SMS без ограничения. При  заказе нескольких пакетов одновременно объемы данных прибавляются,  а&nbsp;срок действия такого объема устанавливается согласно последнему  заказанному пакету.</li>\n</ul>', 1360877517, 0, 1, 1360877517, 943912800, 0, '0000-00-00 00:00:00', 2, '/contents/services/sms.jpg', '', 0, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(36, '9', 'День общения', '', 'Подключайте услугу &laquo;День общения&raquo; и&nbsp;звоните на&nbsp;номера других абонентов &laquo;Киевстар&raquo; и DJUICE абсолютно бесплатно&nbsp;&mdash; не&nbsp;оплачивая длительность разговоров и&nbsp;без платы за соединение!', '<p>Подключайте услугу &laquo;День общения&raquo; и&nbsp;звоните на&nbsp;номера других абонентов &laquo;Киевстар&raquo; и DJUICE абсолютно бесплатно&nbsp;&mdash; не&nbsp;оплачивая длительность разговоров и&nbsp;без платы за соединение!</p>\n<p>Обратите внимание! Услуга доступна в&nbsp;тарифах &laquo;SMS и разговоры&raquo;, &laquo;Больше общения&raquo;,  &laquo;Классический&raquo;, &laquo;Наилучший&raquo;, &laquo;С нами лучше!&raquo;, &laquo;Единая цена&raquo;, &laquo;Единая  страна&raquo;, &laquo;Базовый&raquo;, &laquo;Большая семья&raquo;, &laquo;15 копеек&raquo;, &laquo;Весенний&raquo;, &laquo;Комфорт&raquo;,  &laquo;Комфорт +&raquo;, &laquo;УльтраКомфорт&raquo;, &laquo;Много слов&raquo;, &laquo;Тройное преимущество&raquo;, &laquo;25  миллионов&raquo;, &laquo;Выгодный&raquo;, &laquo;Длинные разговоры&raquo;, &laquo;Счастливый&raquo;, &laquo;Удобный&raquo;,  &laquo;Стандарт&raquo; для абонентов предоплаченной связи.</p>', 1360877613, 0, 1, 1360877613, 943912800, 0, '0000-00-00 00:00:00', 1, '/contents/services/gabbingtohelp.gif', '', 0, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(37, '10', 'Комфортный переход', '', 'Сообщите всем друзьям о&nbsp;том, что Вы&nbsp;изменили свой предыдущий номер мобильного телефона на&nbsp;номер сети &laquo;Киевстар&raquo;!', '<p>Сообщите всем друзьям о&nbsp;том, что Вы&nbsp;изменили свой предыдущий номер мобильного телефона на&nbsp;номер сети &laquo;Киевстар&raquo;!</p>\n<p>Бесплатно активируйте услугу &laquo;Комфортный переход&raquo; и&nbsp;легко переходите  со&nbsp;старого номера &laquo;Киевстар&raquo; или другого мобильного оператора Украины  на&nbsp;новый номер &laquo;Киевстар&raquo; не&nbsp;волнуясь о&nbsp;том, что кто-то не&nbsp;сможет дозвониться на&nbsp;Ваш старый номер.</p>', 1360877752, 0, 1, 1360877752, 943912800, 0, '0000-00-00 00:00:00', 3, '/contents/services/comf9.jpg', '', 0, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(38, '10', 'Антиопределитель номера', '', 'Если Вы&nbsp;собираетесь сделать сюрприз человеку, которому звоните, или&nbsp;же  просто хотите сохранить свой номер в&nbsp;секрете, заказывайте услугу  &laquo;Антиопределитель номера&raquo;.', 'Услуга &laquo;Антиопределитель номера&raquo; позволяет самостоятельно руководить  режимом запрета показа Вашего номера на&nbsp;дисплее телефона абонента сети  &laquo;Киевстар&raquo;, которому Вы&nbsp;звоните. Если Вы&nbsp;не&nbsp;хотите, чтобы при звонке  другому абоненту сети &laquo;Киевстар&raquo; Ваш номер определялся, тогда  воспользуйтесь услугой &laquo;Антиопределитель номера&raquo;.', 1360877841, 0, 1, 1360877841, 943912800, 0, '0000-00-00 00:00:00', 2, '/contents/services/number.JPG', '', 0, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(39, '10', 'Дополнительный номер', '', 'С&nbsp;&laquo;Дополнительным номером&raquo; Вы&nbsp;сможете быть на&nbsp;связи, не&nbsp;разглашая при  этом своего основного номера. Если Вам нужно указать номер мобильного  телефона на каком-то сайте или в&nbsp;объявлении, &laquo;Дополнительный номер&raquo; спасет Вас от&nbsp;лишних телефонных звонков на&nbsp;Ваш основной номер.', '<p>С&nbsp;&laquo;Дополнительным номером&raquo; Вы&nbsp;сможете быть на&nbsp;связи, не&nbsp;разглашая при  этом своего основного номера. Если Вам нужно указать номер мобильного  телефона на каком-то сайте или в&nbsp;объявлении, &laquo;Дополнительный номер&raquo; спасет Вас от&nbsp;лишних телефонных звонков на&nbsp;Ваш основной номер.</p>\n<p>Активировав услугу, Вы&nbsp;сможете получать входные звонки  на&nbsp;&laquo;Дополнительный номер&raquo; и&nbsp;звонить с&nbsp;него, не&nbsp;меняя SIM-карты, а&nbsp;также   получать и&nbsp;отправлять SMS- и MMS-сообщения, используя дополнительный  телефонный номер.</p>', 1360877931, 0, 1, 1360877931, 943912800, 0, '0000-00-00 00:00:00', 1, '/contents/services/bd05092_.gif', '', 0, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(40, '11', 'SMS', '', 'Услуга позволяет Вам общаться с&nbsp;помощью коротких текстовых сообщений.', '<div>\n<p>Услуга позволяет Вам общаться с&nbsp;помощью коротких текстовых сообщений. Отправлять сообщение можно:</p>\n<ul>\n<li>на&nbsp;номера абонентов украинских операторов мобильной связи;</li>\n<li>на&nbsp;номера абонентов зарубежных операторов мобильной связи;</li>\n<li>на&nbsp;адреса электронной почты.</li>\n</ul>\n<p>Длина одного SMS-сообщения&nbsp;&mdash; 160&nbsp;знаков латиницей и&nbsp;70&nbsp;знаков при наборе текстов кириллицей.</p>\n</div>', 1360878053, 0, 1, 1360878053, 943912800, 0, '0000-00-00 00:00:00', 2, '/contents/services/sms.png', '', 0, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(41, '11', 'MMS', '', 'Передавайте по&nbsp;телефону свое настроение и&nbsp;чувства! В&nbsp;этом вам поможет услуга мультимедийных сообщений MMS.', '<div>\n<p>Передавайте по&nbsp;телефону свое настроение и&nbsp;чувства! В&nbsp;этом вам поможет услуга мультимедийных сообщений MMS.</p>\n<p>MMS&nbsp;&mdash; новый уровень вашей свободы! Услуга дает возможность отправлять  и&nbsp;получать: фотографии, изображения, мелодии, видеоролики, текстовые  сообщения большого размера.</p>\n</div>', 1360878150, 0, 1, 1360878150, 943912800, 0, '0000-00-00 00:00:00', 1, '/contents/services/mms.png', '', 0, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(42, '14', 'Мобильный телефон ZTE V970', '', 'Экран 4.3" (540x960) сенсорный IPS / моноблок / процессор NVIDIA Tegra  2, Dual Core 1 ГГц / камера 5 Мп + фронтальная 0.3 Мп / Bluetooth /  Wi-Fi 802.11 / ОЗУ 512 МБ / ПЗУ 4 ГБ + поддержка microSD / разъем 3.5 мм  / GPS / 3G / ОС Android 4.0 / 125х66х9.9 мм, вес 140 г / черный 			<span id="copyinfo"><br />Подробнее: <a href="http://rozetka.com.ua/zte_v970/p243669/">http://rozetka.com.ua/zte_v970/p243669/</a></span>', '', 1360879317, 0, 1, 1360879317, 943912800, 0, '0000-00-00 00:00:00', 3, '/contents/goods/zte_v970_7380856.jpg', '', 0, '243669', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(43, '14', 'HTC Sensation XL x315e UACRF', '', 'Экран 4.7" (480x800, сенсорный) Super-LCD / моноблок / процессор 1.5 ГГц  / камера 8 Мп + фронтальная 1.3 Мп / Bluetooth / Wi-Fi 802.11b/g/n /  RAM 768 МБ / 16 ГБ встроенной памяти / разъем 3.5 мм / 3G / GPS / ОС  Android 2.3.4 (Gingerbread) / 132.5x70.7x9.9 мм, 162.5 г 			<span id="copyinfo"><br />Подробнее: <a href="http://rozetka.com.ua/htc_sensation_xl/p169787/">http://rozetka.com.ua/htc_sensation_xl/p169787/</a></span>', '', 1360879449, 0, 1, 1360879449, 943912800, 0, '0000-00-00 00:00:00', 2, '/contents/goods/htc_sensation_xl_5471936.jpg', '', 0, '169787', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(44, '14', 'Samsung Galaxy Note II N7100 Ceramic White', '', 'Экран 5.55" (1280x720) Full touch + S Pen / моноблок /  четырехъядерный  процессор (1.6 ГГц) / основная камера 8 Мп, фронтальная - 1.9 Мп /  Bluetooth 4.0 / Wi-Fi 802.11b/g/n / SSD 16 ГБ + поддержка карт памяти  microSD / разъем 3.5 мм / 3G / GPS / ОС Android 4.1 (Jelly Bean) / 151.1  x 80.5 x 9.4 мм, вес 182.5 г / белый 			<span id="copyinfo"><br />Подробнее: <a href="http://rozetka.com.ua/samsung_galaxy_note_N7100_ceramic_white/p237343/">http://rozetka.com.ua/samsung_galaxy_note_N7100_ceramic_white/p237343/</a></span>', '', 1360879556, 0, 1, 1360879556, 943912800, 0, '0000-00-00 00:00:00', 1, '/contents/goods/samsung_galaxy_note_N7100_ceramic_white_7365545.jpg', '', 0, '237343', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '');

-- --------------------------------------------------------

--
-- Table structure for table `cmsmenu`
--

DROP TABLE IF EXISTS `cmsmenu`;
CREATE TABLE IF NOT EXISTS `cmsmenu` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `parent_id` int(11) NOT NULL,
  `title` text CHARACTER SET utf8 NOT NULL,
  `title_alias` text NOT NULL,
  `link` text NOT NULL,
  `published` int(11) NOT NULL,
  `ordering` int(11) NOT NULL,
  `checked_out` int(11) NOT NULL,
  `checked_out_time` datetime NOT NULL,
  `browser_nav` text NOT NULL,
  `image` text NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=cp1251 AUTO_INCREMENT=11 ;

--
-- Dumping data for table `cmsmenu`
--

INSERT INTO `cmsmenu` (`id`, `parent_id`, `title`, `title_alias`, `link`, `published`, `ordering`, `checked_out`, `checked_out_time`, `browser_nav`, `image`) VALUES
(1, 0, 'Главная страница', 'mainmenu', '/', 1, 1, 0, '0000-00-00 00:00:00', '0', ''),
(2, 1, 'О нас', '', '/about/about.html', 1, 2, 0, '0000-00-00 00:00:00', '0', ''),
(3, 2, 'История', '', '/about/history.html', 1, 1, 0, '0000-00-00 00:00:00', '0', ''),
(4, 2, 'Сотрудники', '', '/about/employees', 1, 2, 0, '0000-00-00 00:00:00', '0', ''),
(5, 2, 'Преимущества', '', '/about/benefits.html', 1, 3, 0, '0000-00-00 00:00:00', '0', ''),
(6, 1, 'Новости', '', '/news', 1, 3, 0, '0000-00-00 00:00:00', '0', ''),
(7, 1, 'Услуги', '', '/services', 1, 4, 0, '0000-00-00 00:00:00', '0', ''),
(8, 1, 'Товары', '', '/goods', 1, 5, 0, '0000-00-00 00:00:00', '0', ''),
(9, 1, 'Контакты', '', '/contacts.html', 1, 6, 0, '0000-00-00 00:00:00', '0', ''),
(10, 1, 'Главная', '', '/', 0, 1, 0, '0000-00-00 00:00:00', '0', '');

-- --------------------------------------------------------

--
-- Table structure for table `cmsparams`
--

DROP TABLE IF EXISTS `cmsparams`;
CREATE TABLE IF NOT EXISTS `cmsparams` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `ref_number` int(11) NOT NULL,
  `ref_module` text NOT NULL,
  `ref_title` text NOT NULL,
  `ref_type` int(11) NOT NULL,
  `ref_src` text NOT NULL,
  `ref_srcv` int(11) NOT NULL,
  `ref_in_list` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=cp1251 AUTO_INCREMENT=61 ;

--
-- Dumping data for table `cmsparams`
--

INSERT INTO `cmsparams` (`id`, `ref_number`, `ref_module`, `ref_title`, `ref_type`, `ref_src`, `ref_srcv`, `ref_in_list`) VALUES
(1, 1, 'categories', '', 0, '0', 0, 0),
(2, 2, 'categories', '', 0, '0', 0, 0),
(3, 3, 'categories', '', 0, '0', 0, 0),
(4, 4, 'categories', '', 0, '0', 0, 0),
(5, 5, 'categories', '', 0, '', 0, 0),
(6, 6, 'categories', '', 0, '', 0, 0),
(7, 7, 'categories', '', 0, '', 0, 0),
(8, 8, 'categories', '', 0, '', 0, 0),
(9, 9, 'categories', '', 0, '', 0, 0),
(10, 10, 'categories', '', 0, '', 0, 0),
(11, 11, 'categories', '', 0, '', 0, 0),
(12, 12, 'categories', '', 0, '', 0, 0),
(13, 13, 'categories', '', 0, '', 0, 0),
(14, 14, 'categories', '', 0, '', 0, 0),
(15, 15, 'categories', '', 0, '', 0, 0),
(16, 16, 'categories', '', 0, '', 0, 0),
(17, 17, 'categories', '', 0, '', 0, 0),
(18, 18, 'categories', '', 0, '', 0, 0),
(19, 19, 'categories', '', 0, '', 0, 0),
(20, 20, 'categories', '', 0, '', 0, 0),
(21, 1, 'content', 'Артикул', 1, '0', 0, 1),
(22, 2, 'content', '', 0, '0', 0, 0),
(23, 3, 'content', '', 0, '0', 0, 0),
(24, 4, 'content', '', 0, '0', 0, 0),
(25, 5, 'content', '', 0, '0', 0, 0),
(26, 6, 'content', '', 0, '0', 0, 0),
(27, 7, 'content', '', 0, '0', 0, 0),
(28, 8, 'content', '', 0, '0', 0, 0),
(29, 9, 'content', '', 0, '0', 0, 0),
(30, 10, 'content', '', 0, '0', 0, 0),
(31, 11, 'content', '', 0, '0', 0, 0),
(32, 12, 'content', '', 0, '0', 0, 0),
(33, 13, 'content', '', 0, '', 0, 0),
(34, 14, 'content', '', 0, '', 0, 0),
(35, 15, 'content', '', 0, '', 0, 0),
(36, 16, 'content', '', 0, '', 0, 0),
(37, 17, 'content', '', 0, '', 0, 0),
(38, 18, 'content', '', 0, '', 0, 0),
(39, 19, 'content', '', 0, '', 0, 0),
(40, 20, 'content', '', 0, '', 0, 0),
(41, 1, 'users2', '', 0, '', 0, 0),
(42, 2, 'users2', '', 0, '', 0, 0),
(43, 3, 'users2', '', 0, '', 0, 0),
(44, 4, 'users2', '', 0, '', 0, 0),
(45, 5, 'users2', '', 0, '', 0, 0),
(46, 6, 'users2', '', 0, '', 0, 0),
(47, 7, 'users2', '', 0, '', 0, 0),
(48, 8, 'users2', '', 0, '', 0, 0),
(49, 9, 'users2', '', 0, '', 0, 0),
(50, 10, 'users2', '', 0, '', 0, 0),
(51, 11, 'users2', '', 0, '', 0, 0),
(52, 12, 'users2', '', 0, '', 0, 0),
(53, 13, 'users2', '', 0, '', 0, 0),
(54, 14, 'users2', '', 0, '', 0, 0),
(55, 15, 'users2', '', 0, '', 0, 0),
(56, 16, 'users2', '', 0, '', 0, 0),
(57, 17, 'users2', '', 0, '', 0, 0),
(58, 18, 'users2', '', 0, '', 0, 0),
(59, 19, 'users2', '', 0, '', 0, 0),
(60, 20, 'users2', '', 0, '', 0, 0);

-- --------------------------------------------------------

--
-- Table structure for table `cmssession`
--

DROP TABLE IF EXISTS `cmssession`;
CREATE TABLE IF NOT EXISTS `cmssession` (
  `user_id` int(11) NOT NULL,
  `session_id` varchar(200) NOT NULL,
  PRIMARY KEY (`session_id`)
) ENGINE=MyISAM DEFAULT CHARSET=cp1251;

--
-- Dumping data for table `cmssession`
--

INSERT INTO `cmssession` (`user_id`, `session_id`) VALUES
(1, '7140bc12b7ce67cf7a6d4b4ed3bc9f98'),
(2, '33249b1c3b44625500a767fba61349dd');

-- --------------------------------------------------------

--
-- Table structure for table `cmsusers`
--

DROP TABLE IF EXISTS `cmsusers`;
CREATE TABLE IF NOT EXISTS `cmsusers` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `checked_out` int(11) NOT NULL,
  `checked_out_time` datetime NOT NULL,
  `name` text NOT NULL,
  `login` text NOT NULL,
  `email` text NOT NULL,
  `password` text NOT NULL,
  `usertype` int(11) NOT NULL,
  `block` int(11) NOT NULL,
  `register_date` datetime NOT NULL,
  `lastvizit_date` datetime NOT NULL,
  `image` text NOT NULL,
  `param1` text NOT NULL,
  `param2` text NOT NULL,
  `param3` text NOT NULL,
  `param4` text NOT NULL,
  `param5` text NOT NULL,
  `param6` text NOT NULL,
  `param7` text NOT NULL,
  `param8` text NOT NULL,
  `param9` text NOT NULL,
  `param10` text NOT NULL,
  `param11` text NOT NULL,
  `param12` text NOT NULL,
  `param13` text NOT NULL,
  `param14` text NOT NULL,
  `param15` text NOT NULL,
  `param16` text NOT NULL,
  `param17` text NOT NULL,
  `param18` text NOT NULL,
  `param19` text NOT NULL,
  `param20` text NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=cp1251 AUTO_INCREMENT=3 ;

--
-- Dumping data for table `cmsusers`
--

INSERT INTO `cmsusers` (`id`, `checked_out`, `checked_out_time`, `name`, `login`, `email`, `password`, `usertype`, `block`, `register_date`, `lastvizit_date`, `image`, `param1`, `param2`, `param3`, `param4`, `param5`, `param6`, `param7`, `param8`, `param9`, `param10`, `param11`, `param12`, `param13`, `param14`, `param15`, `param16`, `param17`, `param18`, `param19`, `param20`) VALUES
(1, 0, '0000-00-00 00:00:00', '', 'admin', 'shmaliy.maxim@gmail.com', 'ce892fcaa9ba4c0a1840414c7314c138', 10, 0, '2011-02-16 11:08:09', '2013-02-19 09:54:12', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(2, 0, '0000-00-00 00:00:00', 'manager', 'manager', '1@1.com', '97db1846570837fce6ff62a408f1c26a', 10, 0, '2012-11-02 11:17:26', '2012-11-07 10:11:39', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '');

-- --------------------------------------------------------

--
-- Table structure for table `indexation`
--

DROP TABLE IF EXISTS `indexation`;
CREATE TABLE IF NOT EXISTS `indexation` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `url` text NOT NULL,
  `title` text NOT NULL,
  `title_hash` varchar(40) NOT NULL,
  `text` text NOT NULL,
  `prepared_text` text NOT NULL,
  `text_hash` varchar(40) NOT NULL,
  `created` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=cp1251 AUTO_INCREMENT=16 ;

--
-- Dumping data for table `indexation`
--

INSERT INTO `indexation` (`id`, `url`, `title`, `title_hash`, `text`, `prepared_text`, `text_hash`, `created`) VALUES
(1, '/photos/1/8', '', 'd41d8cd98f00b204e9800998ecf8427e', 'Описание альбома', 'Описание альбома', 'e4e08a54f315c10c4f883fdedace9629', 1332029765),
(9, '/photos/1/10', '', 'd41d8cd98f00b204e9800998ecf8427e', '', '', 'd41d8cd98f00b204e9800998ecf8427e', 1332030001),
(10, '/contacts', '', 'd41d8cd98f00b204e9800998ecf8427e', 'Клуб-кафе на Писаржевского \nУстанавливаю новую версу граф. драйвера nvidiaВсплывает  окно:Internet Explorer: Эта страница имеет изъян и может быть опасна!я:  кто бы говорил\n Летнее кафе в парке Шевченко Накрыла как-то ностальгия, и решил я поиграть во что-нибудь  олдскульное. Поставил известный эмулятор известной приставки, нашёл ROM и целую  субботу рубился в Shin Megami Tensei. Пройдя с треть, отправился спать, а с утра  решил продолжить. Как бы не так: эмулятор со странной избирательностью не  воспринимал клавиши.\n&nbsp; ', 'Клуб кафе Писаржевского Устанавливаю новую версу граф драйвера nvidiaВсплывает окно Internet Explorer страница имеет изъян может быть опасна говорил Летнее кафе парке Шевченко Накрыла ностальгия решил поиграть нибудь олдскульное Поставил известный эмулятор известной приставки нашёл целую субботу рубился Shin Megami Tensei Пройдя треть отправился спать утра решил продолжить эмулятор странной избирательностью воспринимал клавиши nbsp ', '2b3e80516f5a0528ff774336df9ec278', 1332160852),
(2, '/about.html', 'О нас', 'eac34b75523d2f4574ab3b9316aa2b90', 'В 1990 году поступил я в МВТУ им. Баумана и попутно  устроился работать оператором в местный вычислительный центр под названием  &laquo;Аквариум&raquo;. Только-только появились первые персоналки, и к нам как раз завезли  суперсовременные компьютеры IBM PC XT. Как водится, студенты сразу же вместо  занятий стали на них играть.Начальство поставило задачу игры запретить.  Сначала пытались бороться словесно &mdash; не помогало. Тогда я решил бороться  программно и взялся за изучение ассемблера. Через пару месяцев появился первый  продукт под названием AntiGame. Программа резидентно висела в памяти,  перехватывала запуск программ через функцию 4Bh 21 прерывания и имела базу  сигнатур различных игр &mdash; просто читался кусок данных размером 32 байта из файла  со смещением 1000h. Если запускаемая программа совпадала с одной из сигнатур, то  считалась игрой. Запуск обрывался, в буфер клавиатуры посылалось echo  y|del., проигрывалась веселая мелодия. Через месяц мелодию знали  все.Пару месяцев всё шло хорошо, база сигнатур пополнялась, студенты  ходили злые и вынуждены были заниматься делом. Но тут группа студентов тоже села  за ассемблер и через месяц хакнула мою программку. Хак быстро распространился  среди посетителей &laquo;Аквариума&raquo;, студенты снова стали довольные, играли  повсеместно, а мелодии было не слышно. Отловив и изучив хак, я выяснил, что там  тупо восстанавливался оригинальный вектор 21 прерывания, и моя программка  обламывалась.Покумекав, я взялся за клавиатуру. Спустя пару месяцев  родился шедевр под названием SuperAntiGame. Это была шедевральная программа,  написанная с использованием всех современных технологий, включая вирусные.  Частично она даже использовала неизвестный тогда механизм &laquo;стелс&raquo;, чем я до сих  пор горжусь. Программа перехватывала 13 и 21 прерывания, причём не обычным  способом, а путём внедрения в точки входа в области DOS, что делало бесполезным  восстановление оригинальных векторов прерывания. В функциях поиска, открытия и  записи файлов делалась проверка на имя файла antigame.exe и в случае  совпадения возвращалась ошибка &laquo;File not found&raquo;, так что ни один из  &laquo;коммандеров&raquo; программу не видел. Также перехватывалось прерывание таймера 1Ch &mdash;  на нём висела функция, постоянно проверяющая код в памяти. Если хотя бы один бит  был изменён, то отключалась клавиатура, запускалась мелодия, флаг read only со  всех файлов в текущем каталоге снимался, а в буфер клавиатуры отправлялось так  любимое студентами echo y|del.. Помимо этого, там было ещё множество  новаторских решений. Полный исходник занимал около 300 КБ текста,  откомпилированный файл &mdash; 9 КБ.Около года лучшие студенческие умы  безуспешно бились за право играть в игрушки и пытались взломать мою программу.  Почти год я ходил королём, пока в один прекрасный день не увидел нагло  ухмыляющегося студента, демонстративно играющего в тетрис и смотрящего на меня с  ехидцей. Моя программа была повержена.Я, конечно, не питал иллюзий и  знал, что рано или поздно это случится. К тому времени подходила к концу  разработка бета-версии нового SuperPuperAntiGame, работающего в защищённом  режиме только вышедшего тогда процессора 386SX, первые компьютеры с которым  появились в нашем &laquo;Аквариуме&raquo;.Жаль, не удалось тогда довести задуманное  до конца &mdash; увлёкся другим делом и AntiGame забросил. Но и сейчас, спустя два  десятилетия, я вспоминаю эту гонку вооружений и думаю, какой же стимул для  изучения программирования дала и сколько же талантливых программистов вырастила  жажда игр.', ' 1990 laquo raquo mdash AntiGame mdash 1000h echo laquo raquo SuperAntiGame laquo raquo antigame laquo File found raquo laquo raquo mdash read only echo mdash SuperPuperAntiGame 386SX laquo raquo mdash AntiGame ', 'd4122836aa4597a178ea97e8c87975e0', 1331407728),
(3, '/services.html', 'Услуги', '8a9ad6b42405ee04ebbb2a3dbbafa841', 'Получила как-то раз одна госконтора  федерального подчинения крупный программный продукт. Написан он был под заказ  столичными спецами, и заплачено им было весьма и весьма много. По факту  оказалось, что программа сырая и много жрущая &mdash; потребляла ресурсы нескольких  серверов, а чуть позже оказалось, что некоторые заявленные функции просто не  работают, а некоторые хоть и работают, но очень криво. Разработчики выслушали  все замечания и претензии и пообещали через год выпустить апдейт.После  того как региональные пользователи запросили совершенно новую функциональность в  рамках того, что делала московская программа, было принято писать новую  программу своими силами. За пару месяцев айтишники госконторы поговорили со  всеми пользователями, на основе их рассказов спроектировали базу данных и  выдвинули требования к будущей программе.Начали писать. За полгода  сделали. Кое-что работало кое-как, кое-что важное работало отлично, кое-что так  и осталось в стадии идей и разработки. Но программу приняли в промышленную  эксплуатацию, провели по всем документам и похвастались перед департаментом в  Москве о том, что и в провинции сидят классные разработчики. Получили  премии.Прошло ещё полгода. Москвичи выпустили обещанный апдейт, который  закрыл ряд багов и добавил функций, но так и не перекрыл очень специфические  возможности местной программки. Радостный ведущий разработчик выпустил ещё пару  обновлений и свалил в коммерческую фирму заниматься цисками.Прошел ещё  год. Московские разработчики выпустили ещё одно обновление и официально сказали:  то направление развития функциональности, о котором им писали из провинции,  некритично, и думать надо по-другому. Согласовали своё мнение в главном  департаменте госконторы и получили ещё денег по госконтракту. В региональном  филиале пользователи возмутились и заявили, что неправильно отказываться от  хороших возможностей автоматизации, и вообще, москвичи неправы. Потом оформили  все новые идеи в письмо о необходимости разработки и отправили  начальству.Начальство подумало, вспомнило о премиях за новые идеи,  согласилось и приказало программу доработать. Вот только старая версия была на  C# и MSSQL, а разработчик, которого наняли взамен старого, знал PHP и чуть-чуть  SQL. Благо все идеи о доработке сводились к созданию пары запросов. Однако срок  доработки по приказу был месячный, потому разработчик перекрестился и сделал  новую программу на PHP. Да, она выводила только результаты этих двух запросов.  Да, оформление было просто никакое, но программа работала &mdash; и работала очень  быстро. А ещё она использовала старую базу и была веб-ориентированной. Потом  разработчик предложил перевести всё на веб, потому что так модно, и через  полгода ушёл работать в крупному региональную контору.Когда вышло новое  обновление большой программы и новые замечания по местной, на должности  разработчика сидел вчерашний студент, который знал Firebird и Delphi, а ещё  очень любил линукс и открытое ПО. Примерно тогда же выяснилось, что давно  используемый MSSQL нелегальный, и денег на его легализацию не предвидится. Так  как разом отказаться от старой базы было невозможно, то пришлось для начала  писать скрипт, который копировал данные каждую ночь из старой базы в новую, и  потихоньку переписывать функциональность двух старых программ в новую  разработку. Естественно, прежде всего студент написал то, что требовало  начальство, и в тестовую эксплуатацмю ушла третья программа, которая работала с  одной задачей, но выполняла новые функции. Пользователям под роспись полетели  новые инструкции о работе с программным продуктом, и на рабочем столе каждого из  них появился очередной ярлычок.Через полгода к разработкам подключились  безопасники и потребовали внести множество изменений. Московский разработчик  отказался от проекта, предоставив госконторе развивать его дальше своими силами,  а студент уволился с тоски.', ' mdash MSSQL mdash Firebird Delphi MSSQL ', '13739143c96e53ad7a2081a67df0ca64', 1331407775);
INSERT INTO `indexation` (`id`, `url`, `title`, `title_hash`, `text`, `prepared_text`, `text_hash`, `created`) VALUES
(4, '/promotion/739', 'Хто стримує розвиток інформатизації міської ради?', '155067f85060c5b2f4c8711d01e9a9a4', '\nОстаннім  часом дніпропетровським Інтернетом й околицями гуляє розлога тема про  якісь нібито зловживання у сфері інформатизації, які вчиняються просто у  стінах Дніпропетровської міської ради "чиновниками-казнокрадами". При  цьому з регулярністю десь один раз на тиждень спливає чергова порція  "скандальних подробиць" про те, як нещасних громадян ошукують на  комп''ютерах, Інтернеті та інших малозрозумілих речах у міському  виконкомі.\nМинулого  тижня група найбільш непримиренних критиків Програми інформатизації  Дніпропетровської міської ради на 2010-2012 роки, зміни до якої були  зняті з порядку денного ХХ чергової сесії буквально за добу до її  початку, використали презентацію нового сайту міської ради, аби -  небувалий випадок - допитати начальника Управління внутрішньої політики  Володимира Михайлишина. Більш ніж сорок депутатів з різних фракцій у  присутності секретаря міської ради Максима Романенка вирішили "суворо  судити" чиновника який задумав неприпустиме - витягти інформаційне  забезпечення роботи тих таки депутатів з рівня 20 століття.\nГоловними  суддями стали позафракційний депутат Борис Васильєв та голова фракції  "Україна Майбутнього" Сергій Жуков. Нагадаємо, саме ці депутати  зауважили під час розгляду програми на комісії з депутатської діяльності, етики, законності та звуків з громадськістю,  що "у міста є більш нагальні проблеми, які потребують вирішення", ніж  витрачання 6,5 мільйонів гривень на інформатизацію діяльності тих таки  депутатів та виконкому.\nЯкщо пройтися вулицями  Дніпропетровська, яким 12 років керує "найуспішніший міський голова  України", Президент Асоціації міст України й таке інше, розумієш, що  крихта істини в тому є. І якщо в останній рік, завдяки обласному  керівництву, але аж ніяк не міському голові чи міській раді, трішки  виправилася ситуація з дорогами, то стан ЖКГ, транспорту чи, наприклад,  зелених насаджень не витримує жодної критики. Але давайте поставимо  питання у дещо іншій площині: чи потрібна місту й міській раді  інформатизація? І чи вартує вона 0,33% від річного бюджету міста?\nЩе кілька місяців тому, тоді "опозиційний" депутат Жуков підтримував давню заяву ГО ГРАД щодо непрозорості сайту міської ради та недотримання  Дніпропетровським міськвиконкомом принципів та вимог законів "Про  інформацію" та "Про доступ до публічної інформації". Він радів появі файлового серверу міської ради й засуджував неоперативність появи на ньому ж проектів  рішень міської ради. І от в новому році цей вправний юрист стає чи  найзапеклішим ворогом інформатизації. В чому причина? Чи не в тому, що  народний депутат Святослав Олійник незадовго до настання 2012 року  оголосив про припинення фінансування партії "Україна майбутнього"? Чи не нові власники вимагають від Жукова настільки неадекватної поведінки?\nАдже  давайте розберемось, проти чого так запально виступає народний  обранець. Програма інформатизації була прийнята у 2010 році під тиском  громадськості з одного боку й на вимогу регуляторних актів Верховної  Ради та Кабінету Міністрів про доступ до інформації - з іншого.\nРішення  й тоді проходило з великими труднощами, через те, що більшість  депутатів, а найбільше - люди, які приймають і підписують рішення, ні в  якому разі не хочуть, аби ці рішення побачила преса, чи не дай боже,  прості громадяни. Адже це може викликати питання типу: хто й на якій  підставі подарував кільком підприємцям землю під "Дитячим світом" і  готелем "Центральним"? А хто дозволив їх зруйнувати? З землею і  будівлями взагалі питання надскладне - у нас то архів Держкомзему  випадково згорить, то архів рішень міської ради із земельних питань  арештує прокуратура й не віддасть. І тут виявляється, що усі (ви  вдумайтесь УСІ рішення, з прізвищами, ініціаторами та виконавцями) мають  стати доступними громадськості!\nПрограму  в 2010 прийняли із застереженнями, курувати її виконання був  призначений керуючий справами виконкому Віталій Мархасін, який навіть  щось там закупив і певну модернізацію провів. На яких підставах -  питання до нього, хоча затверджуючи звіт про виконання бюджету 2010 року  депутати міської ради, у числі яких Сергій Жуков, цим питанням не  перейнялися.\nАле  ані у 2010 році, коли було освоєно лише 193 тисячі гривень, ані у 2011,  коли цю сума зросла до майже двох мільйонів, не було вирішено  кардинально низку проблем, згадувати про які депутати не воліють.  Насамперед, в будівлі міської ради досі не існує централізованої, а  відтак керованої і захищеної локальної мережі. Тобто мережі існують - чи  не в межах кожного департаменту й управління, але в загальну систему  всі комп''ютери не об''єднані. Ба більше ніхто у міській раді&nbsp; на  сьогодні навіть не може сказати, скільки загалом точок входу у мережу  міської ради існує, адже депутати й деякі високопосадовці мають чудову  манеру приносити на роботу й працювати на власних мобільних ЕОМ, безпеку  яких і встановлене програмне забезпечення ніхто не контролює.\nВідповідно,  не існує забезпечення каналу зв''язку Дніпропетровської міської ради з  навколишнім світом. Тобто, знову ж таки, таких каналів безліч, але  більша частина - "невеличкі презенти" від "соціально свідомих  бізнесменів". Про яку безпеку й захист може йти мова, якщо вся вищі  чиновники в місті, включно з міським головою, отримують доступ до  світових мереж по каналах, контрольованих приватними компаніями!?\nКількість  і пропускна здатність цих каналів значно вища, ніж у існуючого  загального каналу міської ради у 5 Мбіт/секунду, через який близько 500  працівників мають доступ до зовнішнього світу й близько 2000-3000  користувачів ззовні отримують доступ до офіційного сайт міської ради та  її серверів. Погано й повільно працює сайт міської ради? А чому ж ви  дивуєтеся? Сьогодні користувачі з домашнім Інтернетом використовують  швидкість від 1 до 100 Мбіт/секунду. А весь міськвиконком разом із  сайтом - 5. "Крадій" Михайлишин запропонував збільшити цей канал до 20  Мбіт/секунду - одразу почалася обструкція й розмови про "більш нагальні  проблеми".\nЗгадаймо  ще один аспект, який ставить дніпропетровську міську раду в ряд сіл й  віддалених районних центрів: чиновники Дніпропетровська ведуть офіційну  переписку через адреси безкоштовних Інтернет-служб! Це у 2012 році!  Прес-секретар міської&nbsp; ради (вдумайтеся!) щоденно розсилає офіційну інформацію до майже двохсот ЗМІ міста та України через адресу на MAIL.RU. І це не виняток. Наші чиновники не розуміють, що надсилання листа від депутата чи міського голови з адреси типу kulich@ukr.net або lena62@bk.ru - страшенна ганьба і жодною перепискою, крім особистої, вважатися не може! Чиновник повинен мати електронну адресу формату zhukovS@dniprorada.gov.ua -  і ніяк інакше, на цю адресу громадяни, ЗМІ чи інші організації  надсилають листи, які носять силу офіційного звернення, на яке чиновник  зобов''язаний відповісти протягом п''яти діб. Але щоб така пошта існувала,  необхідно програмне забезпечення, відповідні сервери пошти (майже 1000  скриньок плюс архів) та оплата праці людині, яка все це буде виконувати.  Але надто принципові депутати проти - це ж треба буде відповідати на  питання всіх цих людей, які нас обрали і від яких ми так вміло  відсторонилися...\nАле повернімось у минулий четвер до сесійної зали Дніпропетровської міської ради, де депутати начебто&nbsp; "вивели  на чисту воду" начальника управління внутрішньої політики. Як  з''ясувалося, у більшої частини депутатів претензій до сайту міської ради  немає. Після модернізації він став швидшим, нагляднішим і естетично  чистішим. З усіх висловлених критичних зауважень на себе звернули увагу  лише недостатність інформації про діяльність депутатів, порожній і від  того непривабливий розділ інвестиційної діяльності та незадовільне  оформлення версії сайту англійською мовою.\nМи  не беремось заперечувати чиїсь враження, але на тій самій презентації  пан Михайлишин запросив депутатські комісії активніше працювати й  висвітлювати свою діяльність. Питання ж інвестицій чи англомовна версія  сайту взагалі не є компетенцією управління внутрішньої політики. "Ви  хотіли функціональний і швидкий сайт - отримуйте! Мало інформації -  наповнюйте!" \nПрисутні  депутати, у тому числі й Борис Васильєв, який виступав у ролі і  депутата, і журналіста, погодилися з поясненнями й щодо розмежування  повноважень, адже кожен з розділів міського сайту має наповнювати певний  департамент чи управління. Так, новини вивішує прес-служба, а файли  проектів рішень - Департамент забезпечення діяльності міської ради.\nДеякі  депутати наголосили на не дуже зручному пошуку в межах файлового  серверу, але тут знову ж таки необхідне фінансування. Аби привести  нормативну базу рішень Дніпропетровської міської ради до вигляду парламентської,  необхідно знову ж таки створити базу даних, перевести всі документи в  електронний вигляд, створити рубрикатор, розробити регламент роботи з  такими документами, а найголовніше - навчити персонал. Це завдання тісно  пов''язане з впровадженням цифрового підпису й електронного  документообігу, чого, до речі, також вимагає від місцевої влади не  тільки час, але і Кабмін. Ціна питання - 590 тисяч гривень. Забагато?  Дивлячись з чим порівнювати. \nАдже  в разі забезпечення публічності рішень міської ради можна щорічно  заощаджувати не мільйони навіть - мільярди, просто блокуючи рішення,  спрямовані на грабунок громади міста. Електронний документообіг при  рівні сучасної бюрократії (кожне рішення міської ради має лист  погодження з 18 - 27 підписів) скоротить проходження рішень через  виконком з існуючих 2-3 місяців до 15-30 хвилин. При цьому можна буде  скоротити 50-60% персоналу, зайнятого виключно перекладанням паперів з  теки в теку й носінням цих паперів коридорами міської ради.\nАле  хіба в Дніпропетровську комусь вигідно прийняття рішень протягом  півгодини і припинення носіння паперів, а разом із нею і "вдячності"  фігурантів рішень тим чи іншим чиновникам чи головам депутатських  комісій? Вже аж ніяк головам цих самих комісій.\nНа  наступній сесії міської ради, призначеній на 29 лютого, рішення про  зміни до Програми інформатизації, скоріш за все, знову відхилять. Цього  разу критики міського сайту зауважили на нібито "гумористичний" елемент  захисту адміністративного входу на сайт. Насправді даний елемент виконує  частину захисту від роботів-шпигунів, а загалом оновлений сайт міської  ради захищений чи не найкраще від інших державних ресурсів. Принаймні на  хвилі повалень сайтів Президента, міністерств та відомств, включно з  СБУ, дві поспіль атаки, здійснені на сайт Дніпропетровської міськради  протягом останнього тижня, не завдали шкоди його функціонуванню. \nНеоднозначна  реакція депутатів на суму, закладену у Програмі на модернізацію сайту  міської ради - 140 тисяч гривень - була погашена секретарем міськради  Максимом Романенком. Він довів до відома зібрання, що ніякі 140 тисяч за  виконану роботу ніхто поки що нікому не платив. Тай дивно було б - адже  виконавці надали для тестування пробну версію оновленого сайту. Не  йшлося ще ані про акти виконаних робіт, ані про підписання платіжок.\nА  ще у програмі - зв''язок будівлі міської ради з віддаленими підрозділами  виконкому (Єдиний дозвільний центр на проспекті Правди 42, районні у  місті ради, тощо), забезпечення джерел безперервного живлення,  забезпечення окремої серверної кімнати з кодовим замком, вентиляцією і  двома джерелами живлення і так далі. Є там і засоби для мультимедійних  та он-лайн трансляцій сесії міської ради. Дивина: у маленькому й бідному  Тернополі всі сесії міської та обласної рад транслюються телебаченням,  а у багатому й розвиненому Дніпропетровську немає 507 тисяч гривень,  аби забезпечити трансляцію і паралельне зберігання фонограми.\nРішення,  чи залишатися у кам''яному віці інформатизації з паперовим  документообігом, чи слідувати вимогам часу й забезпечити діяльність  виконавчої влади хоча б у відповідності до вимог Уряду, приймуть  неодмінно, самі депутати. Але при цьому не завадило б відповісти й на  наступне питання - чи ці люди відстоюють інтереси громади, чи все ж таки  переслідують свої особисті інтереси свої, а може відстоюють право й  далі ловити рибу в непрозорій воді інформаційного безладу?\n', ' Останнім часом дніпропетровським Інтернетом околицями гуляє розлога тема якісь нібито зловживання сфері інформатизації вчиняються просто стінах Дніпропетровської міської ради чиновниками казнокрадами цьому регулярністю десь один тиждень спливає чергова порція скандальних подробиць нещасних громадян ошукують комп ютерах Інтернеті інших малозрозумілих речах міському виконкомі Минулого тижня група найбільш непримиренних критиків Програми інформатизації Дніпропетровської міської ради 2010 2012 роки зміни якої були зняті порядку денного чергової сесії буквально добу початку використали презентацію нового сайту міської ради небувалий випадок допитати начальника Управління внутрішньої політики Володимира Михайлишина Більш сорок депутатів різних фракцій присутності секретаря міської ради Максима Романенка вирішили суворо судити чиновника який задумав неприпустиме витягти інформаційне забезпечення роботи таки депутатів рівня століття Головними суддями стали позафракційний депутат Борис Васильєв голова фракції Україна Майбутнього Сергій Жуков Нагадаємо саме депутати зауважили розгляду програми комісії депутатської діяльності етики законності звуків громадськістю міста більш нагальні проблеми потребують вирішення витрачання мільйонів гривень інформатизацію діяльності таки депутатів виконкому Якщо пройтися вулицями Дніпропетровська яким років керує найуспішніший міський голова України Президент Асоціації міст України таке інше розумієш крихта істини тому якщо останній завдяки обласному керівництву ніяк міському голові міській раді трішки виправилася ситуація дорогами стан транспорту наприклад зелених насаджень витримує жодної критики давайте поставимо питання дещо іншій площині потрібна місту міській раді інформатизація вартує вона річного бюджету міста кілька місяців тому тоді опозиційний депутат Жуков підтримував давню заяву ГРАД щодо непрозорості сайту міської ради недотримання Дніпропетровським міськвиконкомом принципів вимог законів інформацію доступ публічної інформації радів появі файлового серверу міської ради засуджував неоперативність появи ньому проектів рішень міської ради новому році вправний юрист стає найзапеклішим ворогом інформатизації чому причина тому народний депутат Святослав Олійник незадовго настання 2012 року оголосив припинення фінансування партії Україна майбутнього нові власники вимагають Жукова настільки неадекватної поведінки Адже давайте розберемось проти чого запально виступає народний обранець Програма інформатизації була прийнята 2010 році тиском громадськості одного боку вимогу регуляторних актів Верховної Ради Кабінету Міністрів доступ інформації іншого Рішення тоді проходило великими труднощами через більшість депутатів найбільше люди приймають підписують рішення якому разі хочуть рішення побачила преса боже прості громадяни Адже може викликати питання типу якій підставі подарував кільком підприємцям землю Дитячим світом готелем Центральним дозволив зруйнувати землею будівлями взагалі питання надскладне архів Держкомзему випадково згорить архів рішень міської ради земельних питань арештує прокуратура віддасть виявляється вдумайтесь рішення прізвищами ініціаторами виконавцями мають стати доступними громадськості Програму 2010 прийняли застереженнями курувати виконання призначений керуючий справами виконкому Віталій Мархасін який навіть щось закупив певну модернізацію провів яких підставах питання нього хоча затверджуючи звіт виконання бюджету 2010 року депутати міської ради числі яких Сергій Жуков питанням перейнялися 2010 році коли було освоєно лише тисячі гривень 2011 коли сума зросла майже двох мільйонів було вирішено кардинально низку проблем згадувати депутати воліють Насамперед будівлі міської ради досі існує централізованої відтак керованої захищеної локальної мережі Тобто мережі існують межах кожного департаменту управління загальну систему комп ютери єднані більше ніхто міській раді nbsp сьогодні навіть може сказати скільки загалом точок входу мережу міської ради існує адже депутати деякі високопосадовці мають чудову манеру приносити роботу працювати власних мобільних безпеку яких встановлене програмне забезпечення ніхто контролює Відповідно існує забезпечення каналу язку Дніпропетровської міської ради навколишнім світом Тобто знову таки таких каналів безліч більша частина невеличкі презенти соціально свідомих бізнесменів безпеку захист може мова якщо вищі чиновники місті включно міським головою отримують доступ світових мереж каналах контрольованих приватними компаніями Кількість пропускна здатність каналів значно вища існуючого загального каналу міської ради Мбіт секунду через який близько працівників мають доступ зовнішнього світу близько 2000 3000 користувачів ззовні отримують доступ офіційного сайт міської ради серверів Погано повільно працює сайт міської ради чому дивуєтеся Сьогодні користувачі домашнім Інтернетом використовують швидкість Мбіт секунду весь міськвиконком разом сайтом Крадій Михайлишин запропонував збільшити канал Мбіт секунду одразу почалася обструкція розмови більш нагальні проблеми Згадаймо один аспект який ставить дніпропетровську міську раду віддалених районних центрів чиновники Дніпропетровська ведуть офіційну переписку через адреси безкоштовних Інтернет служб 2012 році Прес секретар міської nbsp ради вдумайтеся щоденно розсилає офіційну інформацію майже двохсот міста України через адресу MAIL виняток Наші чиновники розуміють надсилання листа депутата міського голови адреси типу kulich lena62 страшенна ганьба жодною перепискою крім особистої вважатися може Чиновник повинен мати електронну адресу формату zhukovS dniprorada ніяк інакше адресу громадяни інші організації надсилають листи носять силу офіційного звернення чиновник зобов язаний відповісти протягом така пошта існувала необхідно програмне забезпечення відповідні сервери пошти майже 1000 скриньок плюс архів оплата праці людині буде виконувати надто принципові депутати проти треба буде відповідати питання всіх людей обрали яких вміло відсторонилися повернімось минулий четвер сесійної зали Дніпропетровської міської ради депутати начебто nbsp вивели чисту воду начальника управління внутрішньої політики ясувалося більшої частини депутатів претензій сайту міської ради немає Після модернізації став швидшим нагляднішим естетично чистішим усіх висловлених критичних зауважень себе звернули увагу лише недостатність інформації діяльність депутатів порожній того непривабливий розділ інвестиційної діяльності незадовільне оформлення версії сайту англійською мовою беремось заперечувати чиїсь враження самій презентації Михайлишин запросив депутатські комісії активніше працювати висвітлювати свою діяльність Питання інвестицій англомовна версія сайту взагалі компетенцією управління внутрішньої політики хотіли функціональний швидкий сайт отримуйте Мало інформації наповнюйте Присутні депутати тому числі Борис Васильєв який виступав ролі депутата журналіста погодилися поясненнями щодо розмежування повноважень адже кожен розділів міського сайту наповнювати певний департамент управління новини вивішує прес служба файли проектів рішень Департамент забезпечення діяльності міської ради Деякі депутати наголосили дуже зручному пошуку межах файлового серверу знову таки необхідне фінансування привести нормативну базу рішень Дніпропетровської міської ради вигляду парламентської необхідно знову таки створити базу даних перевести документи електронний вигляд створити рубрикатор розробити регламент роботи такими документами найголовніше навчити персонал завдання тісно язане впровадженням цифрового підпису електронного документообігу чого речі також вимагає місцевої влади тільки Кабмін Ціна питання тисяч гривень Забагато Дивлячись порівнювати Адже разі забезпечення публічності рішень міської ради можна щорічно заощаджувати мільйони навіть мільярди просто блокуючи рішення спрямовані грабунок громади міста Електронний документообіг рівні сучасної бюрократії кожне рішення міської ради лист погодження підписів скоротить проходження рішень через виконком існуючих місяців хвилин цьому можна буде скоротити персоналу зайнятого виключно перекладанням паперів теки теку носінням паперів коридорами міської ради хіба Дніпропетровську комусь вигідно прийняття рішень протягом півгодини припинення носіння паперів разом вдячності фігурантів рішень іншим чиновникам головам депутатських комісій ніяк головам самих комісій наступній сесії міської ради призначеній лютого рішення зміни Програми інформатизації скоріш знову відхилять Цього разу критики міського сайту зауважили нібито гумористичний елемент захисту адміністративного входу сайт Насправді даний елемент виконує частину захисту роботів шпигунів загалом оновлений сайт міської ради захищений найкраще інших державних ресурсів Принаймні хвилі повалень сайтів Президента міністерств відомств включно поспіль атаки здійснені сайт Дніпропетровської міськради протягом останнього тижня завдали шкоди його функціонуванню Неоднозначна реакція депутатів суму закладену Програмі модернізацію сайту міської ради тисяч гривень була погашена секретарем міськради Максимом Романенком довів відома зібрання ніякі тисяч виконану роботу ніхто поки нікому платив дивно було адже виконавці надали тестування пробну версію оновленого сайту йшлося акти виконаних робіт підписання платіжок програмі язок будівлі міської ради віддаленими підрозділами виконкому Єдиний дозвільний центр проспекті Правди районні місті ради тощо забезпечення джерел безперервного живлення забезпечення окремої серверної кімнати кодовим замком вентиляцією двома джерелами живлення далі засоби мультимедійних лайн трансляцій сесії міської ради Дивина маленькому бідному Тернополі сесії міської обласної транслюються телебаченням багатому розвиненому Дніпропетровську немає тисяч гривень забезпечити трансляцію паралельне зберігання фонограми Рішення залишатися яному віці інформатизації паперовим документообігом слідувати вимогам часу забезпечити діяльність виконавчої влади хоча відповідності вимог Уряду приймуть неодмінно самі депутати цьому завадило відповісти наступне питання люди відстоюють інтереси громади таки переслідують свої особисті інтереси свої може відстоюють право далі ловити рибу непрозорій воді інформаційного безладу ', '934304efe04a6b48f885d874acfd5189', 1331547781),
(5, '/news/721', '"Дніпро" розгромив іспанців з різницею у 9 голів', '615acd527e88c19270f49542c1f57ccc', 'Дніпропетровський "Дніпро" провів перший товариський матч на зборі в  іспанському Кампоаморі. Підопічні Хуанде Рамоса потренувалися на команді  однієї з регіональних ліг Іспанії "Хорададі", для гравців якої футбол  це хобі.\nПро те, що "Дніпро" і "Хорадада" знаходяться на  абсолютно різних футбольних орбітах, красномовно говорить хоча б той  факт, що голкіпер дніпропетровців Ігор Варцаба лише по разу торкнувся  м''яча в кожному таймі. А "Дніпро" провів дуже багато небезпечних атак і  міг забити м''ячів 20, але обмежився дев''ятьма.\nРоман Зозуля забив  тричі. По два голи записали на свій рахунок Нікола Калініч і Матеус. По  голу забили Джуліано та Євген Коноплянка.\nДНІПРО - ХОРАДАДА - 9:0\nДніпро:  91. Варцаба, 3. Мазух (5. Мандзюк, 46), 7. Кулаков (8. Джуліано, 46),  11. Олійник (10. Коноплянка, 46), 14. Чеберячко, 17. Стрініч, 18.  Зозуля, 24. Пашаєв, 29. Ротань (4. Кравченко, 46), 30. Шахов (36.  Бабенко, 46), 99. Матеус (9. Калініч, 46)\nХорадада:  1. Крістіан, 2. Кампільо, 3. Антоніо, 4. Роха, 5. Обама (12. Кіке, 38),  6. Фернандес (16. Льюіс, 41), 7. Маріо, 8. Хосе Марія, 9. Пелегрін, 10.  Хаві, 11. Еней (14. Альфонсо, 20)\nГоли:&nbsp;Зозуля 3,&nbsp;13, 60; Матеус 21, 43; Калініч 53, 87; Джуліано 70; Коноплянка 73', 'Дніпропетровський Дніпро провів перший товариський матч зборі іспанському Кампоаморі Підопічні Хуанде Рамоса потренувалися команді однієї регіональних Іспанії Хорададі гравців якої футбол хобі Дніпро Хорадада знаходяться абсолютно різних футбольних орбітах красномовно говорить хоча факт голкіпер дніпропетровців Ігор Варцаба лише разу торкнувся кожному таймі Дніпро провів дуже багато небезпечних атак забити ячів обмежився ятьма Роман Зозуля забив тричі голи записали свій рахунок Нікола Калініч Матеус голу забили Джуліано Євген Коноплянка ДНІПРО ХОРАДАДА Дніпро Варцаба Мазух Мандзюк Кулаков Джуліано Олійник Коноплянка Чеберячко Стрініч Зозуля Пашаєв Ротань Кравченко Шахов Бабенко Матеус Калініч Хорадада Крістіан Кампільо Антоніо Роха Обама Кіке Фернандес Льюіс Маріо Хосе Марія Пелегрін Хаві Еней Альфонсо Голи nbsp Зозуля nbsp Матеус Калініч Джуліано Коноплянка ', 'a5f2c08e90c5c6fbe9c8deaed83aeaf6', 1331548683),
(6, '/contacts.html', 'Контактная информация', '2776ff5c643b4e823445028d35d516a3', 'Я своему ребёнку сказал, что разрешу пользоваться  компьютером, только если он его сам соберёт. Думал, сразу охладеет к этой идее,  а он у друзей настрелял старых комплектующих, даже монитор выпросил &mdash; и с горем  пополам собрал. Школу недавно перевели на линукс, и на самодельный комп сын  поставил его же.Рутовый пароль я узнал сразу &mdash; прочитал надпись  карандашом на боку монитора. Потом отправил сынку сообщение якобы от лица  провайдера о переходе на тарифный план, при котором интернет будут обрубать  каждый день с 21:00 и на всю ночь. Дальше &mdash; дело техники. Написал маленькую  программку, которая каждый день ровно в 21:00 подключается к самоделке по  телнету и отправляет команду ifconfig eth0 down. Пока подвоха сын не  обнаружил.', ' своему ребёнку сказал разрешу пользоваться компьютером только если соберёт Думал сразу охладеет этой идее друзей настрелял старых комплектующих даже монитор выпросил mdash горем пополам собрал Школу недавно перевели линукс самодельный комп поставил Рутовый пароль узнал сразу mdash прочитал надпись карандашом боку монитора Потом отправил сынку сообщение якобы лица провайдера переходе тарифный план котором интернет будут обрубать каждый день ночь Дальше mdash дело техники Написал маленькую программку которая каждый день ровно подключается самоделке телнету отправляет команду ifconfig eth0 down Пока подвоха обнаружил ', '35251e0858c4bd692cb3ecca05490cc2', 1331554249),
(7, '/photos/1/arhXIB', 'День искренности и заоблачных чувств', 'b72d8251f380edb830a0d4da1f3b1e69', '', '', 'd41d8cd98f00b204e9800998ecf8427e', 1331554296),
(8, '/news/729', 'Звільнити вулиці від імен катів обіцяють на найближчій сесії міськради', '9505aea298a6d83217ce3f1b9d6fa447', 'Після&nbsp;пікету&nbsp;за  перейменування вулиць Косіора, Чубаря і Постишева керуючий справами  виконкому Дніпропетровської міськради Микола Отченко провів зустріч з  головою Дніпропетровської міської організації ВО &laquo;Свобода&raquo; Андрієм  Денисенком. \nЗа  словами Денисенка, чиновник зазначив, що політична воля на  перейменування цих вулиць у міськраді є, та запевнив, що відповідне  питання має бути винесене і розглянуте на найближчій сесії міськради.  Вона запланована на 29 лютого.\nЯк  повідомляв Дніпроград, рішення щодо зміни назв вулиць знайшло розуміння  у депутатській комісії з питань топоніміки, затверджене виконкомом  міської ради. Вулиці Косіора пропонують повернути попередню назву -  Бульварна, Постишева - льотчика Попкова, Чубаря - назвати на честь  останнього дніпровського лоцмана Омельченка - засновника музею  лоцманства, краєзнавця, патріота.', ' nbsp nbsp laquo raquo ', '5d31b53668d566d0b619c79ec050d974', 1331631709);
INSERT INTO `indexation` (`id`, `url`, `title`, `title_hash`, `text`, `prepared_text`, `text_hash`, `created`) VALUES
(11, '/contacts?name=&email=&phone=&comment=&captcha%5Bid%5D=397a88b731b931e3f2a6d4ab7d204d91&captcha%5Binput%5D=&submit=%CE%F2%EF%F0%E0%E2%E8%F2%FC', '', 'd41d8cd98f00b204e9800998ecf8427e', 'Клуб-кафе на Писаржевского \nУстанавливаю новую версу граф. драйвера nvidiaВсплывает  окно:Internet Explorer: Эта страница имеет изъян и может быть опасна!я:  кто бы говорил\n Летнее кафе в парке Шевченко Накрыла как-то ностальгия, и решил я поиграть во что-нибудь  олдскульное. Поставил известный эмулятор известной приставки, нашёл ROM и целую  субботу рубился в Shin Megami Tensei. Пройдя с треть, отправился спать, а с утра  решил продолжить. Как бы не так: эмулятор со странной избирательностью не  воспринимал клавиши.\n&nbsp; ', 'Клуб кафе Писаржевского Устанавливаю новую версу граф драйвера nvidiaВсплывает окно Internet Explorer страница имеет изъян может быть опасна говорил Летнее кафе парке Шевченко Накрыла ностальгия решил поиграть нибудь олдскульное Поставил известный эмулятор известной приставки нашёл целую субботу рубился Shin Megami Tensei Пройдя треть отправился спать утра решил продолжить эмулятор странной избирательностью воспринимал клавиши nbsp ', '2b3e80516f5a0528ff774336df9ec278', 1332161931),
(12, '/contacts?name=&email=&phone=&comment=&captcha%5Bid%5D=590483a464f2e8c51be979d1fddfc0d2&captcha%5Binput%5D=&submit=%CE%F2%EF%F0%E0%E2%E8%F2%FC', '', 'd41d8cd98f00b204e9800998ecf8427e', 'Клуб-кафе на Писаржевского \nУстанавливаю новую версу граф. драйвера nvidiaВсплывает  окно:Internet Explorer: Эта страница имеет изъян и может быть опасна!я:  кто бы говорил\n Летнее кафе в парке Шевченко Накрыла как-то ностальгия, и решил я поиграть во что-нибудь  олдскульное. Поставил известный эмулятор известной приставки, нашёл ROM и целую  субботу рубился в Shin Megami Tensei. Пройдя с треть, отправился спать, а с утра  решил продолжить. Как бы не так: эмулятор со странной избирательностью не  воспринимал клавиши.\n&nbsp; ', 'Клуб кафе Писаржевского Устанавливаю новую версу граф драйвера nvidiaВсплывает окно Internet Explorer страница имеет изъян может быть опасна говорил Летнее кафе парке Шевченко Накрыла ностальгия решил поиграть нибудь олдскульное Поставил известный эмулятор известной приставки нашёл целую субботу рубился Shin Megami Tensei Пройдя треть отправился спать утра решил продолжить эмулятор странной избирательностью воспринимал клавиши nbsp ', '2b3e80516f5a0528ff774336df9ec278', 1332161966),
(13, '/services', 'Услуги', '8a9ad6b42405ee04ebbb2a3dbbafa841', 'Получила как-то раз одна госконтора  федерального подчинения крупный программный продукт. Написан он был под заказ  столичными спецами, и заплачено им было весьма и весьма много. По факту  оказалось, что программа сырая и много жрущая &mdash; потребляла ресурсы нескольких  серверов, а чуть позже оказалось, что некоторые заявленные функции просто не  работают, а некоторые хоть и работают, но очень криво. Разработчики выслушали  все замечания и претензии и пообещали через год выпустить апдейт.', 'Получила одна госконтора федерального подчинения крупный программный продукт Написан заказ столичными спецами заплачено было весьма весьма много факту оказалось программа сырая много жрущая mdash потребляла ресурсы нескольких серверов чуть позже оказалось некоторые заявленные функции просто работают некоторые хоть работают очень криво Разработчики выслушали замечания претензии пообещали через выпустить апдейт ', '9ffe032707590d1e0f3aa32a7b1c182e', 1332245209),
(14, '/services/5701', 'Изготовление тортов на заказ', 'a9bc112b65f032d1eff49b3418d7c02f', 'Пользователи пугаются &laquo;дружественного&raquo; интерфейса новой версии программы?  Разработчики и внедряльщики этого дела сейчас скажут: &laquo;Мы их из хрущёвки в  небоскрёб переселяем, а они не хотят &mdash; привыкли, что сортир в другом углу  квартиры, да и лифта побаиваются&raquo;.', 'Пользователи пугаются laquo дружественного raquo интерфейса новой версии программы Разработчики внедряльщики этого дела сейчас скажут laquo хрущёвки небоскрёб переселяем хотят mdash привыкли сортир другом углу квартиры лифта побаиваются raquo ', '773de8cba90ed8888c90d44753bae2f7', 1332247541),
(15, '/photos/1/82012', '', 'd41d8cd98f00b204e9800998ecf8427e', '', '', 'd41d8cd98f00b204e9800998ecf8427e', 1332259739);

-- --------------------------------------------------------

--
-- Table structure for table `regions_gorod`
--

DROP TABLE IF EXISTS `regions_gorod`;
CREATE TABLE IF NOT EXISTS `regions_gorod` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `obl_id` int(11) NOT NULL,
  `title` text NOT NULL,
  `latitude` text NOT NULL,
  `longitude` text NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=cp1251 AUTO_INCREMENT=407 ;

--
-- Dumping data for table `regions_gorod`
--

INSERT INTO `regions_gorod` (`id`, `obl_id`, `title`, `latitude`, `longitude`) VALUES
(1, 26, 'Алупка', '44.4197222', '34.0430556'),
(2, 26, 'Алушта', '44.6637211', '34.405013'),
(3, 26, 'Армянск', '46.1072222', '33.6933333'),
(4, 26, 'Бахчисарай', '44.7527778', '33.8608333'),
(5, 26, 'Белогорск', '45.0544444', '34.6022222'),
(6, 26, 'Джанкой', '45.7086111', '34.3933333'),
(7, 26, 'Евпатория', '45.2036111', '33.3613889'),
(8, 26, 'Керчь', '45.33786', '36.458401'),
(9, 26, 'Красноперекопск', '45.962849', '33.787121'),
(10, 26, 'Саки', '45.1336111', '33.5772222'),
(11, 26, 'Симферополь', '44.9480556', '34.1041667'),
(12, 26, 'Старый Крым', '45.0291667', '35.0886111'),
(13, 26, 'Судак', '44.858799', '34.974979'),
(14, 26, 'Феодосия', '45.0488889', '35.3791667'),
(15, 26, 'Щёлкино', '45.4281023', '35.8165187'),
(16, 26, 'Ялта', '44.4994444', '34.1552778'),
(17, 27, 'Бар', '49.630283', '27.001648'),
(18, 27, 'Бершадь', '48.368954', '29.5331654'),
(19, 27, 'Винница', '49.2333333', '28.4833333'),
(20, 27, 'Гайсин', '48.8094444', '29.3905556'),
(21, 27, 'Жмеринка', '49.038349', '28.10556'),
(22, 27, 'Казатин', '49.711769', '28.842859'),
(23, 27, 'Калиновка', '49.4472222', '28.5230556'),
(24, 27, 'Ладыжин', '48.676151', '29.262541'),
(25, 27, 'Могилёв-Подольский', '48.45', '27.8'),
(26, 27, 'Немиров', '48.9726621', '28.835666'),
(27, 27, 'Погребище', '49.4833333', '29.2666667'),
(28, 27, 'Тульчин', '48.68', '28.87'),
(29, 27, 'Хмельник', '49.563469', '27.959379'),
(30, 27, 'Шаргород', '48.73761', '28.08688'),
(31, 27, 'Ямполь', '49.9572775', '26.2290711'),
(32, 28, 'Берестечко', '50.3505636', '25.1007738'),
(33, 28, 'Владимир-Волынский', '50.853578', '24.311783'),
(34, 28, 'Горохов', '50.500622', '24.767559'),
(35, 28, 'Камень-Каширский', '51.6241667', '24.9605556'),
(36, 28, 'Киверцы', '50.833621', '25.460706'),
(37, 28, 'Ковель', '51.212898', '24.71343'),
(38, 28, 'Луцк', '50.75', '25.3358333'),
(39, 28, 'Любомль', '51.2230556', '24.0377778'),
(40, 28, 'Нововолынск', '50.7333333', '24.1666667'),
(41, 28, 'Рожище', '50.915901', '25.268551'),
(42, 28, 'Устилуг', '50.86', '24.15'),
(43, 29, 'Апостолово', '47.65815', '33.697819'),
(44, 29, 'Верхнеднепровск', '48.6561111', '34.3283333'),
(45, 29, 'Вольногорск', '48.4833333', '34.0166667'),
(46, 29, 'Днепродзержинск', '48.5166667', '34.6166667'),
(47, 29, 'Днепропетровск', '48.45', '34.9833333'),
(48, 29, 'Жёлтые Воды', '48.35', '33.5'),
(49, 29, 'Кривой Рог', '47.899726', '33.379534'),
(50, 29, 'Марганец', '47.6397222', '34.6363889'),
(51, 29, 'Никополь', '47.5666667', '34.4'),
(52, 29, 'Новомосковск', '48.6333333', '35.2166667'),
(53, 29, 'Орджоникидзе', '44.9643961', '35.3569007'),
(54, 29, 'Павлоград', '48.533939', '35.869282'),
(55, 29, 'Перещепино', '49.016251', '35.371681'),
(56, 29, 'Першотравенск', '48.3463889', '36.4044444'),
(57, 29, 'Подгородное', '49.5355598', '25.5276081'),
(58, 29, 'Пятихатки', '48.4113889', '33.7105556'),
(59, 29, 'Синельниково', '48.3177778', '35.5119444'),
(60, 29, 'Терновка', '48.5402778', '29.9677778'),
(61, 30, 'Авдеевка', '48.1333333', '37.7333333'),
(62, 30, 'Артёмовск', '48.599072', '37.999241'),
(63, 30, 'Волноваха', '47.596119', '37.490429'),
(64, 30, 'Горловка', '48.346432', '38.059513'),
(65, 30, 'Дзержинск', '48.4', '37.8333333'),
(66, 30, 'Дебальцево', '48.3333333', '38.4'),
(67, 30, 'Димитров', '48.32357', '37.291854'),
(68, 30, 'Доброполье', '48.4691324', '37.0871223'),
(69, 30, 'Докучаевск', '47.770821', '37.684361'),
(70, 30, 'Донецк', '48.0027778', '37.8052778'),
(71, 30, 'Дружковка', '48.6166667', '37.5333333'),
(72, 30, 'Енакиево', '48.2166667', '38.2'),
(73, 30, 'Ждановка', '48.1462985', '38.2540176'),
(74, 30, 'Зугрэс', '48.0166667', '38.2666667'),
(75, 30, 'Кировское', '48.15', '38.3666667'),
(76, 30, 'Краматорск', '48.736462', '37.57164'),
(77, 30, 'Красноармейск', '48.2827778', '37.1827778'),
(78, 30, 'Красный Лиман', '48.984211', '37.810329'),
(79, 30, 'Константиновка', '48.51545', '37.703629'),
(80, 30, 'Мариуполь', '47.1166667', '37.55'),
(81, 30, 'Макеевка', '48.076179', '38.068427'),
(82, 30, 'Новогродовка', '48.2045408', '37.336821'),
(83, 30, 'Селидово', '48.144671', '37.297897'),
(84, 30, 'Славянск', '48.846851', '37.57954'),
(85, 30, 'Снежное', '48.0282789', '38.7656122'),
(86, 30, 'Соледар', '48.6833333', '38.1'),
(87, 30, 'Торез', '48.0166667', '38.6333333'),
(88, 30, 'Угледар', '47.7833333', '37.25'),
(89, 30, 'Харцызск', '48.037411', '38.160301'),
(90, 30, 'Шахтёрск', '48.0333333', '38.4833333'),
(91, 30, 'Ясиноватая', '48.1221425', '37.8765944'),
(92, 31, 'Андрушёвка', '50.0166667', '29.0166667'),
(93, 31, 'Барановка', '50.30204', '27.67634'),
(94, 31, 'Бердичев', '49.903381', '28.599251'),
(95, 31, 'Житомир', '50.259749', '28.676248'),
(96, 31, 'Коростень', '50.95', '28.6333333'),
(97, 31, 'Коростышев', '50.316639', '29.06653'),
(98, 31, 'Малин', '50.77121', '29.25297'),
(99, 31, 'Новоград-Волынский', '50.59256', '27.62348'),
(100, 31, 'Овруч', '51.327251', '28.818979'),
(101, 31, 'Радомышль', '50.4947222', '29.2333333'),
(102, 32, 'Берегово', '48.2', '22.6333333'),
(103, 32, 'Виноградов', '48.138142', '23.041519'),
(104, 32, 'Иршава', '48.310911', '23.037711'),
(105, 32, 'Мукачево', '48.442411', '22.723352'),
(106, 32, 'Перечин', '48.7341667', '22.4741667'),
(107, 32, 'Рахов', '48.060829', '24.205059'),
(108, 32, 'Свалява', '48.5472222', '22.9861111'),
(109, 32, 'Тячев', '48.0113889', '23.5722222'),
(110, 32, 'Ужгород', '48.6166667', '22.3'),
(111, 32, 'Хуст', '48.1813889', '23.2977778'),
(112, 32, 'Чоп', '48.4333333', '22.2'),
(113, 33, 'Бердянск', '46.748581', '36.809502'),
(114, 33, 'Васильевка', '47.433708', '35.27816'),
(115, 33, 'Вольнянск', '47.9419444', '35.4280556'),
(116, 33, 'Гуляйполе', '47.658562', '36.252918'),
(117, 33, 'Днепрорудное', '47.3840983', '34.98121'),
(118, 33, 'Запорожье', '47.853748', '35.157139'),
(119, 33, 'Каменка-Днепровская', '47.488911', '34.400761'),
(120, 33, 'Мелитополь', '46.847839', '35.364979'),
(121, 33, 'Молочанск', '47.206982', '35.59618'),
(122, 33, 'Орехов', '47.5666667', '35.7833333'),
(123, 33, 'Пологи', '47.47728', '36.25626'),
(124, 33, 'Приморск', '46.7333333', '36.35'),
(125, 33, 'Токмак', '47.25', '35.7'),
(126, 33, 'Энергодар', '47.4979877', '34.6565334'),
(127, 34, 'Болехов', '49.070011', '23.864719'),
(128, 34, 'Бурштын', '49.263802', '24.634211'),
(129, 34, 'Галич', '49.1247222', '24.7286111'),
(130, 34, 'Городенка', '48.6675', '25.5002778'),
(131, 34, 'Долина', '51.79', '33.76'),
(132, 34, 'Ивано-Франковск', '48.9166667', '24.7166667'),
(133, 34, 'Калуш', '49.050465', '24.374117'),
(134, 34, 'Коломыя', '48.53146', '25.039709'),
(135, 34, 'Косов', '48.315', '25.0952778'),
(136, 34, 'Надворная', '48.6333333', '24.5833333'),
(137, 34, 'Рогатин', '49.411449', '24.62051'),
(138, 34, 'Снятын', '48.45', '25.5666667'),
(139, 34, 'Тысменица', '48.9008333', '24.8491667'),
(140, 34, 'Тлумач', '48.8666667', '25.0'),
(141, 34, 'Яремче', '48.449523', '24.557508'),
(142, 35, 'Белая Церковь', '49.7988889', '30.1152778'),
(143, 35, 'Березань', '50.3197222', '31.47'),
(144, 35, 'Богуслав', '49.541031', '30.88073'),
(145, 35, 'Борисполь', '50.350491', '30.960739'),
(146, 35, 'Боярка', '49.323518', '30.700165'),
(147, 35, 'Бровары', '50.5166667', '30.8166667'),
(148, 35, 'Буча', '50.5569165', '30.2230733'),
(149, 35, 'Васильков', '50.178959', '30.32715'),
(150, 35, 'Вишнёвое', '50.4377778', '33.3822222'),
(151, 35, 'Вышгород', '50.5833333', '30.5'),
(152, 35, 'Ирпень', '50.5166667', '30.25'),
(153, 35, 'Кагарлык', '49.85722', '30.82032'),
(154, 35, 'Киев', '50.584981', '30.235748'),
(155, 35, 'Мироновка', '49.661022', '30.98458'),
(156, 35, 'Обухов', '50.105728', '30.630699'),
(157, 35, 'Переяслав-Хмельницкий', '50.070141', '31.45775'),
(158, 35, 'Припять', '51.4977778', '24.1180556'),
(159, 35, 'Ржищев', '49.972801', '31.04777'),
(160, 35, 'Сквира', '49.73719', '29.66901'),
(161, 35, 'Славутич', '51.523777', '30.768559'),
(162, 35, 'Тараща', '49.56065', '30.510309'),
(163, 35, 'Тетиев', '49.370575', '29.680221'),
(164, 35, 'Узин', '49.820228', '30.438929'),
(165, 35, 'Украинка', '50.1530861', '30.7434917'),
(166, 35, 'Фастов', '50.0833333', '29.9166667'),
(167, 35, 'Чернобыль', '51.2666667', '30.2166667'),
(168, 35, 'Яготин', '50.244949', '31.796261'),
(169, 36, 'Александрия', '48.6666667', '33.1166667'),
(170, 36, 'Бобринец', '48.050861', '32.16589'),
(171, 36, 'Гайворон', '48.3333333', '29.8666667'),
(172, 36, 'Долинская', '48.1108333', '32.7647222'),
(173, 36, 'Знаменка', '48.7166667', '32.6666667'),
(174, 36, 'Кировоград', '48.508389', '32.264801'),
(175, 36, 'Малая Виска', '48.65', '31.6333333'),
(176, 36, 'Новомиргород', '48.7833333', '31.65'),
(177, 36, 'Новоукраинка', '48.3155556', '31.5269444'),
(178, 36, 'Светловодск', '49.0502778', '33.2419444'),
(179, 37, 'Александровск', '48.5861652', '39.1949396'),
(180, 37, 'Алмазная', '48.5166667', '38.5833333'),
(181, 37, 'Алчевск', '48.4666667', '38.8'),
(182, 37, 'Антрацит', '48.1166667', '39.0833333'),
(183, 37, 'Брянка', '48.5133333', '38.6430556'),
(184, 37, 'Вахрушево', '48.174579', '38.837224'),
(185, 37, 'Горное', '49.1805556', '23.7341667'),
(186, 37, 'Зимогорье', '48.5833333', '38.9333333'),
(187, 37, 'Золотое', '48.6928568', '38.5146349'),
(188, 37, 'Зоринск', '48.4131636', '38.6204799'),
(189, 37, 'Краснодон', '48.29607', '39.745239'),
(190, 37, 'Красный Луч', '48.134041', '38.931419'),
(191, 37, 'Лисичанск', '48.896895', '38.444143'),
(192, 37, 'Луганск', '48.573269', '39.355659'),
(193, 37, 'Лутугино', '48.4019444', '39.2102778'),
(194, 37, 'Миусинск', '48.07', '38.9'),
(195, 37, 'Молодогвардейск', '48.3444444', '39.6583333'),
(196, 37, 'Новодружеск', '48.9666667', '38.35'),
(197, 37, 'Новопсков', '49.544731', '39.103889'),
(198, 37, 'Первомайск', '48.05', '30.85'),
(199, 37, 'Перевальск', '48.4388889', '38.8194444'),
(200, 37, 'Петровское', '48.293331', '38.888614'),
(201, 37, 'Попасная', '48.6333333', '38.38'),
(202, 37, 'Приволье', '49.016706', '38.302668'),
(203, 37, 'Ровеньки', '48.0833333', '39.3666667'),
(204, 37, 'Рубежное', '49.0166667', '38.3666667'),
(205, 37, 'Сватово', '49.41011', '38.15258'),
(206, 37, 'Свердловск', '48.084549', '39.65163'),
(207, 37, 'Северодонецк', '48.950191', '38.497631'),
(208, 37, 'Старобельск', '49.2666667', '38.9166667'),
(209, 37, 'Стаханов', '48.5666667', '38.65'),
(210, 37, 'Суходольск', '48.3523068', '39.7239205'),
(211, 37, 'Счастье', '48.737247', '39.2311974'),
(212, 37, 'Теплогорск', '48.600487', '38.5920825'),
(213, 37, 'Червонопартизанск', '48.095566', '39.759607'),
(214, 38, 'Белз', '50.380501', '24.01269'),
(215, 38, 'Бобрка', '49.6331904', '24.2907476'),
(216, 38, 'Борислав', '49.28476', '23.42137'),
(217, 38, 'Броды', '50.0833333', '25.15'),
(218, 38, 'Буск', '49.9666667', '24.6333333'),
(219, 38, 'Великие Мосты', '50.24', '24.1394444'),
(220, 38, 'Глиняны', '49.8233333', '24.5166667'),
(221, 38, 'Городок', '49.1666667', '26.5666667'),
(222, 38, 'Добромиль', '49.5666667', '22.7833333'),
(223, 38, 'Дрогобыч', '49.34853', '23.51647'),
(224, 38, 'Дубляны', '49.8833333', '24.0833333'),
(225, 38, 'Жидачов', '49.3813889', '24.1408333'),
(226, 38, 'Жолква', '50.0666667', '23.9666667'),
(227, 38, 'Золочев', '49.8083333', '24.9011111'),
(228, 38, 'Каменка-Бугская', '50.1', '24.35'),
(229, 38, 'Львов', '49.85', '24.0166667'),
(230, 38, 'Мостиска', '49.7941667', '23.1525'),
(231, 38, 'Перемышляны', '49.67', '24.5594444'),
(232, 38, 'Пустомыты', '49.7138889', '23.9108333'),
(233, 38, 'Рава-Русская', '50.230431', '23.628309'),
(234, 38, 'Радехов', '50.2827778', '24.6375'),
(235, 38, 'Рудки', '49.6530556', '23.4880556'),
(236, 38, 'Самбор', '49.5166667', '23.2027778'),
(237, 38, 'Сколе', '49.036049', '23.51232'),
(238, 38, 'Сокаль', '50.4833333', '24.2833333'),
(239, 38, 'Старый Самбор', '49.4430556', '23.0033333'),
(240, 38, 'Стрый', '49.256171', '23.850306'),
(241, 38, 'Трускавец', '49.2805556', '23.505'),
(242, 38, 'Угнев', '50.3666667', '23.7444444'),
(243, 38, 'Хыров', '49.5333333', '22.85'),
(244, 38, 'Червоноград', '50.3833333', '24.2333333'),
(245, 38, 'Яворов', '49.942501', '23.390989'),
(246, 39, 'Баштанка', '47.404331', '32.445301'),
(247, 39, 'Вознесенск', '47.587711', '31.336'),
(248, 39, 'Николаев', '46.9666667', '32.0'),
(249, 39, 'Новая Одесса', '47.3166667', '31.7833333'),
(250, 39, 'Новый Буг', '47.6833333', '32.5'),
(251, 39, 'Очаков', '46.6166667', '31.55'),
(252, 39, 'Первомайск', '48.05', '30.85'),
(253, 39, 'Снигирёвка', '47.0666667', '32.8166667'),
(254, 39, 'Южноукраинск', '47.8166667', '31.1833333'),
(255, 40, 'Ананьев', '47.7173', '29.975639'),
(256, 40, 'Арциз', '45.99739', '29.431288'),
(257, 40, 'Балта', '47.9333333', '29.6166667'),
(258, 40, 'Белгород-Днестровский', '46.1833333', '30.3333333'),
(259, 40, 'Болград', '45.682701', '28.61935'),
(260, 40, 'Измаил', '45.3516667', '28.8363889'),
(261, 40, 'Ильичёвск', '46.3020534', '30.6517391'),
(262, 40, 'Килия', '45.45578', '29.273291'),
(263, 40, 'Кодыма', '48.093941', '29.13368'),
(264, 40, 'Котовск', '47.75', '29.5333333'),
(265, 40, 'Одесса', '46.4666667', '30.7333333'),
(266, 40, 'Татарбунары', '45.841418', '29.62284'),
(267, 40, 'Теплодар', '46.5', '30.3333333'),
(268, 40, 'Южное', '47.8173262', '33.5737487'),
(269, 41, 'Гадяч', '50.3666667', '34.0'),
(270, 41, 'Глобино', '49.3833333', '33.2833333'),
(271, 41, 'Гребёнка', '50.116852', '32.44059'),
(272, 41, 'Зеньков', '50.20955', '34.362345'),
(273, 41, 'Карловка', '49.45', '35.1333333'),
(274, 41, 'Кременчуг', '49.073521', '33.4231'),
(275, 41, 'Кобеляки', '49.145439', '34.213638'),
(276, 41, 'Комсомольск', '49.013756', '33.643381'),
(277, 41, 'Лохвица', '50.36319', '33.253288'),
(278, 41, 'Лубны', '50.0166667', '33.0'),
(279, 41, 'Миргород', '49.963799', '33.61869'),
(280, 41, 'Пирятин', '50.23975', '32.514309'),
(281, 41, 'Полтава', '49.59269', '34.551159'),
(282, 41, 'Хорол', '49.790279', '33.207809'),
(283, 41, 'Червонозаводское', '50.4', '33.4'),
(284, 42, 'Березне', '51.0', '26.75'),
(285, 42, 'Дубно', '50.38738', '25.754559'),
(286, 42, 'Дубровица', '51.571209', '26.56805'),
(287, 42, 'Здолбунов', '50.5166667', '26.25'),
(288, 42, 'Корец', '50.619129', '27.161869'),
(289, 42, 'Костополь', '50.8833333', '26.45'),
(290, 42, 'Кузнецовск', '51.3436553', '25.8490867'),
(291, 42, 'Острог', '50.3333333', '26.5166667'),
(292, 42, 'Радивилов', '50.125777', '25.264195'),
(293, 42, 'Ровно', '50.6166667', '26.25'),
(294, 42, 'Сарны', '51.3372222', '26.6058333'),
(295, 43, 'Ахтырка', '50.29855', '34.892052'),
(296, 43, 'Белополье', '51.149402', '34.3175225'),
(297, 43, 'Бурынь', '51.1978', '33.847351'),
(298, 43, 'Глухов', '51.6786111', '33.9113889'),
(299, 43, 'Кролевец', '51.550121', '33.38279'),
(300, 43, 'Конотоп', '51.237469', '33.21217'),
(301, 43, 'Лебедин', '48.96', '31.52'),
(302, 43, 'Путивль', '51.337589', '33.87888'),
(303, 43, 'Ромны', '50.743919', '33.475712'),
(304, 43, 'Середина-Буда', '52.1833333', '34.0333333'),
(305, 43, 'Сумы', '50.910561', '34.80566'),
(306, 43, 'Тростянец', '50.9599282', '25.55378'),
(307, 43, 'Шостка', '51.86282', '33.487831'),
(308, 44, 'Бережаны', '49.444191', '24.94486'),
(309, 44, 'Борщёв', '48.803181', '26.041809'),
(310, 44, 'Бучач', '49.05772', '25.401979'),
(311, 44, 'Залещики', '48.65', '25.7333333'),
(312, 44, 'Збараж', '49.6666667', '25.7777778'),
(313, 44, 'Зборов', '49.660696', '25.1434667'),
(314, 44, 'Кременец', '50.099129', '25.7328'),
(315, 44, 'Лановцы', '49.8659402', '26.0841931'),
(316, 44, 'Монастыриска', '49.0888889', '25.1694444'),
(317, 44, 'Подволочиск', '49.5246859', '26.137326'),
(318, 44, 'Подгайцы', '49.2694444', '25.1361111'),
(319, 44, 'Почаев', '50.0', '25.5083333'),
(320, 44, 'Скалат', '49.424214', '25.976246'),
(321, 44, 'Тернополь', '49.551361', '25.603979'),
(322, 44, 'Теребовля', '49.29348', '25.699551'),
(323, 44, 'Чортков', '49.0166667', '25.8'),
(324, 44, 'Шумск', '50.122577', '26.1149716'),
(325, 45, 'Балаклея', '49.4658333', '36.8677778'),
(326, 45, 'Барвенково', '48.9', '37.0166667'),
(327, 45, 'Богодухов', '50.1654302', '35.5267251'),
(328, 45, 'Валки', '49.843601', '35.61388'),
(329, 45, 'Великий Бурлук', '50.0455556', '37.3905556'),
(330, 45, 'Волчанск', '50.278519', '36.945171'),
(331, 45, 'Дергачи', '50.110668', '36.114361'),
(332, 45, 'Змиев', '49.701939', '36.355171'),
(333, 45, 'Изюм', '49.2127778', '37.2569444'),
(334, 45, 'Красноград', '49.3666667', '35.45'),
(335, 45, 'Купянск', '49.721901', '37.624329'),
(336, 45, 'Лозовая', '48.891684', '36.325786'),
(337, 45, 'Люботин', '49.95', '35.9166667'),
(338, 45, 'Мерефа', '49.8166667', '36.05'),
(339, 45, 'Первомайский', '49.3833333', '36.2166667'),
(340, 45, 'Харьков', '49.98967', '36.208309'),
(341, 45, 'Чугуев', '49.8355556', '36.6863889'),
(342, 46, 'Берислав', '46.843822', '33.4375'),
(343, 46, 'Геническ', '46.171638', '34.80777'),
(344, 46, 'Голая Пристань', '46.5166667', '32.5166667'),
(345, 46, 'Каховка', '46.817388', '33.494325'),
(346, 46, 'Новая Каховка', '46.7666667', '33.3666667'),
(347, 46, 'Скадовск', '46.116871', '32.913731'),
(348, 46, 'Таврийск', '46.7528018', '33.4216856'),
(349, 46, 'Херсон', '46.653368', '32.629424'),
(350, 46, 'Цюрупинск', '46.62', '32.72'),
(351, 47, 'Волочиск', '49.535179', '26.22331'),
(352, 47, 'Городок', '49.1666667', '26.5666667'),
(353, 47, 'Деражня', '49.267071', '27.440269'),
(354, 47, 'Дунаевцы', '48.8909743', '26.8546608'),
(355, 47, 'Изяслав', '50.119221', '26.82629'),
(356, 47, 'Каменец-Подольский', '48.6833333', '26.5833333'),
(357, 47, 'Красилов', '49.6519444', '26.9705556'),
(358, 47, 'Нетешин', '50.3374232', '26.6404529'),
(359, 47, 'Полонное', '50.122269', '27.511909'),
(360, 47, 'Славута', '49.0563905', '27.3944506'),
(361, 47, 'Староконстантинов', '49.7555556', '27.2208333'),
(362, 47, 'Хмельницкий', '49.4166667', '27.0'),
(363, 47, 'Шепетовка', '50.179131', '27.07732'),
(364, 48, 'Ватутино', '49.0166667', '31.0666667'),
(365, 48, 'Городище', '49.290649', '31.443199'),
(366, 48, 'Жашков', '49.245522', '30.11998'),
(367, 48, 'Звенигородка', '49.075489', '30.967911'),
(368, 48, 'Золотоноша', '49.674271', '32.040421'),
(369, 48, 'Каменка', '49.036347', '32.103481'),
(370, 48, 'Канев', '49.75', '31.4666667'),
(371, 48, 'Корсунь-Шевченковский', '49.421051', '31.268993'),
(372, 48, 'Монастырище', '48.9909154', '29.8051363'),
(373, 48, 'Смела', '49.224621', '31.878401'),
(374, 48, 'Тальное', '48.8833333', '30.7'),
(375, 48, 'Умань', '48.75', '30.2166667'),
(376, 48, 'Христиновка', '48.8494444', '29.97'),
(377, 48, 'Черкассы', '49.4333333', '32.0666667'),
(378, 48, 'Чигирин', '49.072498', '32.683578'),
(379, 48, 'Шпола', '49.00349', '31.385559'),
(380, 49, 'Бахмач', '51.1830556', '32.8297222'),
(381, 49, 'Бобровица', '50.745', '31.3869444'),
(382, 49, 'Борзна', '51.249451', '32.43034'),
(383, 49, 'Городня', '51.8905556', '31.5936111'),
(384, 49, 'Десна', '50.9246667', '30.756'),
(385, 49, 'Ичня', '50.863918', '32.39307'),
(386, 49, 'Корюковка', '51.7754831', '32.2595792'),
(387, 49, 'Мена', '51.521759', '32.21888'),
(388, 49, 'Нежин', '51.0380556', '31.8861111'),
(389, 49, 'Новгород-Северский', '52.0069896', '33.2537069'),
(390, 49, 'Носовка', '50.9333333', '31.5833333'),
(391, 49, 'Прилуки', '50.594181', '32.38689'),
(392, 49, 'Седнев', '51.6463023', '31.5616846'),
(393, 49, 'Семёновка', '52.173561', '32.587059'),
(394, 49, 'Чернигов', '51.503653', '31.293167'),
(395, 49, 'Щорс', '51.819321', '31.94846'),
(396, 50, 'Вашковцы', '48.38', '25.51'),
(397, 50, 'Вижница', '48.25', '25.1916667'),
(398, 50, 'Герца', '48.1485764', '26.2572996'),
(399, 50, 'Заставна', '48.5166667', '25.85'),
(400, 50, 'Кицмань', '48.4425', '25.7613889'),
(401, 50, 'Новоднестровск', '48.5833333', '27.4333333'),
(402, 50, 'Новоселица', '48.2166667', '26.2666667'),
(403, 50, 'Сокиряны', '48.45', '27.4166667'),
(404, 50, 'Сторожинец', '48.1666667', '25.7166667'),
(405, 50, 'Хотин', '48.5', '26.5'),
(406, 50, 'Черновцы', '48.3', '25.9333333');

-- --------------------------------------------------------

--
-- Table structure for table `regions_obl`
--

DROP TABLE IF EXISTS `regions_obl`;
CREATE TABLE IF NOT EXISTS `regions_obl` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `title` text NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=cp1251 AUTO_INCREMENT=51 ;

--
-- Dumping data for table `regions_obl`
--

INSERT INTO `regions_obl` (`id`, `title`) VALUES
(44, 'Тернопольская область'),
(43, 'Сумская область'),
(42, 'Ровенская область'),
(41, 'Полтавская область'),
(40, 'Одесская область'),
(39, 'Николаевская область'),
(38, 'Львовская область'),
(37, 'Луганская область'),
(36, 'Кировоградская область'),
(35, 'Киевская область'),
(34, 'Ивано-Франковская область'),
(33, 'Запорожская область'),
(32, 'Закарпатская область'),
(31, 'Житомирская область'),
(30, 'Донецкая область'),
(29, 'Днепропетровская область'),
(28, 'Волынская область'),
(27, 'Винницкая область'),
(26, 'Автономная Республика Крым'),
(45, 'Харьковская область'),
(46, 'Херсонская область'),
(47, 'Хмельницкая область'),
(48, 'Черкасская область'),
(49, 'Черниговская область'),
(50, 'Черновицкая область');

-- --------------------------------------------------------

--
-- Table structure for table `subscription`
--

DROP TABLE IF EXISTS `subscription`;
CREATE TABLE IF NOT EXISTS `subscription` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `name` text NOT NULL,
  `mail` text NOT NULL,
  `phone` text NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=cp1251 AUTO_INCREMENT=2 ;

--
-- Dumping data for table `subscription`
--

INSERT INTO `subscription` (`id`, `name`, `mail`, `phone`) VALUES
(1, 'Шмалий Максим', 'shmaliy.maxim@gmail.com', '0939334956');

-- --------------------------------------------------------

--
-- Table structure for table `tags`
--

DROP TABLE IF EXISTS `tags`;
CREATE TABLE IF NOT EXISTS `tags` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `tag` text NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=cp1251 AUTO_INCREMENT=10 ;

--
-- Dumping data for table `tags`
--

INSERT INTO `tags` (`id`, `tag`) VALUES
(1, 'клубы'),
(2, 'лесбиянки'),
(3, 'геи'),
(4, 'голые'),
(5, 'алкоголички'),
(6, 'алкоголики'),
(7, 'проститутки'),
(8, 'измена'),
(9, 'минет');
